[
  {
    "id": "north-stein-river",
    "riverId": "north-stein-river",
    "name": "North Stein River",
    "difficultyClass": "Class V+",
    "description": "Overview: Remote, multiday, hike in, hard core creeking.  Includes a pleasant paddle out on the main Stein.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/north-stein-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:24.004259Z",
    "updatedAt": "2025-11-18T19:11:24.004259Z",
    "season": "July-August, depending on the snowpack.",
    "permits": "Moderate.  Portaging in the steep section is easy compared to the approach.",
    "flowUnit": "cms",
    "estimatedTime": "4-5 days, including the main Stein.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "mamquam-river-mamquam-falls",
    "riverId": "mamquam-river",
    "name": "Mamquam Falls",
    "difficultyClass": "Class V",
    "description": "Overview: One of the world's most sought after big waterfalls, and one of the whitewater crown jewels of the Sea to Sky.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/mamquam-river-mamquam-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:03.073195Z",
    "updatedAt": "2025-11-18T19:11:03.073195Z",
    "season": "Peak snowmelt or after rain.  Flow is negatively impacted by a power project and needs high water to be possible.",
    "permits": "Easy access for scouting.  Park and huck.",
    "flowUnit": "cms",
    "estimatedTime": "A few hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "big-creek-lower",
    "riverId": "big-creek",
    "name": "Lower",
    "difficultyClass": "Class V with a big portage",
    "description": "Overview: Scrappy, dangerous whitewater through a remote canyon\n\nFlows: In most years the thin alpine snowpack melts off early during May and June, possibly extending into July. While there are small glaciers in the alpine headwaters, they are not big enough to sustain runnable flows through the summer. In some years (e.g. 2019), major summer thunderstorms can hit the Chilcotin Plateau, and the large area of this plateau can lead to flooding, but in most years this run will be done by July. The information here is from a descent at 12cms in July 2020 ( BIG CREEK ABOVE GROUNDHOG CREEK (08MB006) ), which was a low runnable flow. Below 10cms is not recommended, and while flows up to 20cms may improve the quality of some of the whitewater, the added push may put some of the canyons into the V+ range. Keep in mind that the gauge is upstream of several diversions for agriculture and wetlands, which may influence the actual flow in this reach. 2020 hydrograph for and historical averages for Big Creek. 10-20cms probably represents the runnable flow window.\n\nShuttle: Access to the take out is one hour out of Williams Lake, by following Highway 20 west for 46km, turning left onto the Farwell Canyon Road (unpaved), and following this 22km down into the Chilcotin River canyon. There are several take out options near the Farwell Canyon bridge, a common one being near the old cabin on river right. To get to the put in, continue along Farwell Canyon Road up and out of the canyon for another 34km, staying right at the Y, until reaching the Erickson Bridge over Big Creek. Much of the land near the put in is private property outside of the road right of way. There are alternate put in options downstream of this bridge which cut out flatwater, but these involve route finding and 4x4 driving in sticky mud. It should be possible to evacuate to Farwell Canyon Road on river right from any point during the run, as it is never further than 5km away cross country to the SE, but this would be a last resort.\n\nOn the Water: From the bridge, the first ~20km is mellow class II-III whitewater traversing the fields and small forests of the Chilcotin Plateau. There are some logjams and small canyons, but with some luck you shouldn't have to get out of your boat. IMPORTANT - At some point (approximately",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/big-creek-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:20.549673Z",
    "updatedAt": "2025-11-18T19:08:20.549673Z",
    "putIn": "is private property outside of the road right of way",
    "takeOut": "is one hour out of Williams Lake, by following Highway 20 west for 46km, turning left onto the Farwell Canyon Road (unpaved), and following this 22km down into the Chilcotin River canyon",
    "season": "Snowmelt May-July",
    "permits": "One major portage around an unrunnable canyon. Several dangerous portages over landslide debris.",
    "hazards": [
      "Portage required",
      "Unrunnable canyon"
    ],
    "minRecommendedFlow": 10.0,
    "maxRecommendedFlow": 20.0,
    "flowUnit": "cms",
    "stationId": "08MB006",
    "estimatedTime": "1-2 days",
    "coordinates": {
      "latitude": 51.78594,
      "longitude": -122.77957
    },
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "williams-creek",
    "riverId": "williams-creek",
    "name": "Williams Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: The local home run, with high quality smooth granite boulders and bedrock.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/williams-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:59.251996Z",
    "updatedAt": "2025-11-18T19:12:59.251996Z",
    "season": "Early season snowmelt and/or after rain.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "1-3 hours.  Quick when you know the run.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "bridge-river-terzaghi-dam-to-yalakom",
    "riverId": "bridge-river",
    "name": "Terzaghi Dam to Yalakom",
    "difficultyClass": "Class III-IV (IV+ at big releases)",
    "description": "Overview: Low Water Boulder garden run which occasionally has releases.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bridge-river-terzaghi-dam-to-yalakom",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:41.539482Z",
    "updatedAt": "2025-11-18T19:08:41.539482Z",
    "length": 15.0,
    "season": "Early Summer",
    "permits": "Road scout almost everything on the way up, can portage everything.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "soo-river",
    "riverId": "soo-river",
    "name": "Soo River",
    "difficultyClass": "Class IV at medium levels, somewhat continuous.  Tolerates high water very well, but becomes class V.",
    "description": "Overview: Fun river running in a small valley.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/soo-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:05.307502Z",
    "updatedAt": "2025-11-18T19:12:05.307502Z",
    "season": "All summer - runnable over a wide range of levels.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "klastline",
    "riverId": "klastline",
    "name": "Klastline",
    "difficultyClass": "Class V",
    "description": "Overview: A northern BC adventure. Remote and with only a handful of descents the Klastline is a good option for anyone who plans to be in the area and wants to run something other than the Stikine. Some class 4 bedrock rapids, 2 big waterfalls (one that has yet to be run) and some steep boulder gardens make for varied if not \"ultra-classic\" whitewater.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/klastline",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:44.105437Z",
    "updatedAt": "2025-11-18T19:10:44.105437Z",
    "season": "Late August - early September, when the Stikine is in.",
    "permits": "Everything can be scouted. There are 2 large waterfalls that are most likely portages",
    "hazards": [
      "Portage required",
      "Waterfall"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 days",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "clendinning-creek",
    "riverId": "clendinning-creek",
    "name": "Clendinning Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Quality 2 day boulder run with very continuous whitewater and stunning scenery.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clendinning-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:30.528864Z",
    "updatedAt": "2025-11-18T19:09:30.528864Z",
    "season": "Late August through September.",
    "permits": "Easy to moderate - everything can be walked.",
    "minRecommendedFlow": 60.0,
    "maxRecommendedFlow": 70.0,
    "flowUnit": "cms",
    "stationId": "08GA071",
    "estimatedTime": "2 days.",
    "coordinates": {
      "latitude": 29.0,
      "longitude": 2010.0
    },
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "capilano-river",
    "riverId": "capilano-river",
    "name": "Capilano River",
    "difficultyClass": "Class III",
    "description": "Overview: A short run in North Vancouver flowing through a scenic canyon with easy whitewater.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/capilano-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:49.433586Z",
    "updatedAt": "2025-11-18T19:08:49.433586Z",
    "season": "After heavy rain.  Runs at low water during snowmelt.",
    "permits": "Scouting is easy.  It's unlikely you'll need to portage anything unless the river is flooding.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 30.0,
    "maxRecommendedFlow": 40.0,
    "flowUnit": "cms",
    "estimatedTime": "15 minutes - 2 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "dipper-creek",
    "riverId": "dipper-creek",
    "name": "Dipper Creek",
    "difficultyClass": "Class V+",
    "description": "Overview: Big waterfalls, mandatory class V, huge commitment.  Top tier adventure boating in a fantastic canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/dipper-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:41.691317Z",
    "updatedAt": "2025-11-18T19:09:41.691317Z",
    "season": "Late fall - usually October.",
    "permits": "Difficult to impossible. Portaging or even walking out for much of the creek is not an option.",
    "maxRecommendedFlow": 80.0,
    "flowUnit": "cms",
    "estimatedTime": "At minimum 1 day.  Probably multiple days if you want to descend the whole creek without previous knowledge.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "upper-pingston",
    "riverId": "upper-pingston",
    "name": "Upper Pingston",
    "difficultyClass": "Class V",
    "description": "Overview: One of B.C.'s best steep creeks. Classic whitewater; continuous, clean, few portages and a handful of bigger rapids. Not much is \"must run\", but be prepared to run a good amount of class 5 if you put on as either too much portaging or hiking out would be a lot of work and probably end in the dark. If the upper is too high the middle is a good back up option.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/upper-pingston",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:47.906815Z",
    "updatedAt": "2025-11-18T19:12:47.906815Z",
    "season": "Late June to mid to late July. Usually run as things are coming down from peak runoff.",
    "permits": "Scout whenever you think you should. Everything has been run except one short canyon that is portaged on the right.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 8.0,
    "maxRecommendedFlow": 15.0,
    "flowUnit": "cms",
    "stationId": "08NE123",
    "estimatedTime": "4-8 hours depending on group size and familiarity.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "eagle-river",
    "riverId": "eagle-river",
    "name": "Eagle River",
    "difficultyClass": "Class I-III with one portage",
    "description": "Overview: Remote wilderness expedition with easy whitewater\n\nFlows: Freshet usually starts in May and tapers off in July in the Cassiar region. The nearest gauge is in a different watershed, but may be helpful for estimating flows (COTTONWOOD RIVER ABOVE BASS CREEK (10AC005)). A flow of ~40cms may suggest a low but acceptable flow on the Eagle River Historical Max/Min/Mean Hydrometric Data Graph for COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) [BC]. From a different drainage, but may represent flow conditions in the region.\n\nShuttle: Fly in to Eaglehead Lake from Dease Lake (50km). Packrafters may be able to find a way to hike in. Take out at the road accessible French Creek recreation site approximately 2 hours drive north of Dease Lake along Highway 37. There are earlier takeout possibilities that are not as straightforward.\n\nOn the Water: The exit from Eaglehead Lake is shallow and will probably require boat dragging until reaching a couple tributaries. Most of the rest of the Eagle River is class I-II boulder dodging. There are two sections of easy class III: a short canyon above the confluence with the Little Eagle, and the lead in to the portage rapid. The portage rapid is a manky 5m waterfall with class III rapids above and below. There is no pool above the drop and it is on a blind corner. There is only one drop to portage, but the portage length could be 100-1000m depending on your comfort level. The Dease River is flat, painfully so at times. Some stretches have awesome island camping, while other sections have steep brushy banks. Keep an eye out for wildlife. On my trip I saw moose, porcupines, beavers, eagles, swans, osprey, otters, a wolverine, and a grizzly bear.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/eagle-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:48.104534Z",
    "updatedAt": "2025-11-18T19:09:48.104534Z",
    "takeOut": "at the road accessible French Creek recreation site approximately 2 hours drive north of Dease Lake along Highway 37",
    "season": "Early Summer (May-July)",
    "permits": "The portage is around one manky 5m waterfall, but may be longer if also portaging the class III lead in",
    "hazards": [
      "Portage required",
      "Waterfall"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3-10 days",
    "difficultyMin": 1,
    "difficultyMax": 3
  },
  {
    "id": "skagit-river-wilderness-section",
    "riverId": "skagit-river",
    "name": "Wilderness Section",
    "difficultyClass": "Class II-III",
    "description": "Overview: A wilderness float through old growth forest",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/skagit-river-wilderness-section",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:54.490911Z",
    "updatedAt": "2025-11-18T19:11:54.490911Z",
    "season": "Late Spring - May-June",
    "permits": "Expect many wood portages",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours, long shuttle",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "mahatta-river",
    "riverId": "mahatta-river",
    "name": "Mahatta River",
    "difficultyClass": "Class IV with one harder rapid",
    "description": "Overview: A fun west coast canyon hidden at the end of the island.\n\nFlows: The Mahatta is a fairly low elevation watershed, and it is doubtful that there is any snowmelt season. A good west coast rain should get this going; for comparison, it is in a similar climatic zone as the Sarita River near Bamfield. There is no gauge on the Mahatta, but there is on the adjacent Klaskish River (KLASKISH RIVER NEAR KLASKINO INLET (08HE009)). A 20-30mm rain and the Klaskish gauge dropping off a 50cms spike resulted in a medium-high level on the Mahatta River. These rivers will flash up and down quickly. KLASKISH RIVER NEAR KLASKINO INLET (08HE009), 2018 gauge data and maximum flows. You'll have to catch one of these rain spikes to run the Mahatta.\n\nShuttle: The downside is that this river is way out there, 1.5 hours on a rough road past Port Alice, which is 4.5 hours drive from the Nanaimo ferry terminal. The upside is that with the orientation of the river and the ocean paddle, you don't really need a shuttle car. To find the put in, use your map to follow Marine Drive south out of Port Alice (road radio recommended). The route will wrap around Neroutsos Inlet, climb up a pass in the Teeta Creek drainage (T500 road), and drop into the Mahatta area. There are put in options at the Mahatta River Recreation Site or a nearby FSR bridge. The takeout is a further 4km to the right (north) down the Mahatta FSR, at a logging landing on the ocean.\n\nOn the Water: Beginning at the Mahatta River Recreation Site, there is ~7km of class I-II, including one easy canyon and probably a logjam or two. The whitewater section is only ~2km long. The start of the gradient is obvious, at the first of two class IV rapids which ramp into 90 degree corners. Following these are two rapids with ledge holes. Below here, the river canyons up noticeably for the crux rapid (class V), which is scouted on the right. This one is worth a scout, as half the river flows through a sieve. There are informal trails to portage on river right. Finally, there is one more clean ledge dropping down to tidewater and the estuary. Turn right (east), and follow the coast ~6km through the Koskimo Islands (sea otter zone), past a fish farm, and across to the takeout at the Mahatta logging landing.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/mahatta-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:01.499341Z",
    "updatedAt": "2025-11-18T19:11:01.499341Z",
    "putIn": "options at the Mahatta River Recreation Site or a nearby FSR bridge",
    "takeOut": "is a further 4km to the right (north) down the Mahatta FSR, at a logging landing on the ocean",
    "season": "October to April. Needs a good amount of rain.",
    "permits": "Reasonable until the canyon, then possible by roping boats",
    "flowUnit": "cms",
    "estimatedTime": "4-5 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "chilliwack-river-tamihi-to-pointa-vista",
    "riverId": "chilliwack-river",
    "name": "Tamihi to Pointa Vista",
    "difficultyClass": "Class III, one IV- @ Tamihi",
    "description": "Overview: Some continuous boulder gardens especially at higher levels, pool drop, gravel bed, medium volume.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilliwack-river-tamihi-to-pointa-vista",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:22.515305Z",
    "updatedAt": "2025-11-18T19:09:22.515305Z",
    "season": "Year round, possibly too low in winter and late summer if it does not rain.",
    "permits": "Easy to scout",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "tamihi-creek-lower",
    "riverId": "tamihi-creek-lower",
    "name": "Tamihi Creek (Lower)",
    "difficultyClass": "Class IV+ with a mandatory portage",
    "description": "Overview: Manky boulder garden turning into steep committing canyon with fun class IV drops towards the end.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tamihi-creek-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:22.349547Z",
    "updatedAt": "2025-11-18T19:12:22.349547Z",
    "season": "Fall/Winter/Spring",
    "permits": "Everything is scoutable but portaging is tricky in some areas.",
    "flowUnit": "cms",
    "estimatedTime": "3-5 hours, if you knew where the wood is and the lines could be as short as 1.5 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "benson-river-upper",
    "riverId": "benson-river",
    "name": "Upper",
    "difficultyClass": "Class IV+ at low water",
    "description": "Overview: A short low volume canyon in the middle of nowhere\n\nFlows: There are no gauges in this area, but the Upper Benson is a tight low volume creek, and low winter flows are probably best for a safe descent. At the put in, it should look like just enough flow to kayak. Any sort of big rain spike or high flows is going to be class V. This portion of the Benson River is above all the lakes, so flows may be flashy as is typical for the island. Furthermore, the Vanishing River is subtracted through a cave above the Upper Benson, and transferred to the Reappearing River into the Raging River. None of that water flows through this reach.\n\nShuttle: To get to the put in, drive north on the island highway to just beyond Port McNeill, and turn left on the Keogh FSR to a bridge at 35.5km. The takeout is ~2km downstream on river left along another FSR near Merry Widow Mountain.\n\nOn the Water: Most, but not all of the rapids can be scouted at river level; those that cannot can be scouted and presumably portaged on river left above the low canyon walls. There are a few points that feel committing, and although the road is close to the left a hike out will probably involve a healthy bushwhack. If this run is full of wood it will be a lot of work to scout, but in 2022 it was totally clean. Although the rock is mostly limestone, the cave factor does not appear to be in play, but there is some pin/piton factor. The character is somewhat reminiscent of the in between boogie rapids on the Cameron River. Take out once the road reappears on river left, or a bit further downstream at a bridge to the Raging River IPP. The first set from the air.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/benson-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:18.868102Z",
    "updatedAt": "2025-11-18T19:08:18.868102Z",
    "takeOut": "is ~2km downstream on river left along another FSR near Merry Widow Mountain",
    "season": "October to April with moderate rain. Spring snowmelt possible",
    "permits": "Mostly possible but not always",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "pitt-river-upper",
    "riverId": "pitt-river",
    "name": "Upper",
    "difficultyClass": "Class IV+ with a portage",
    "description": "Overview: Remote, multi-day wilderness run with tricky logistics and challenging paddling.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/pitt-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:30.325218Z",
    "updatedAt": "2025-11-18T19:11:30.325218Z",
    "season": "Late summer & fall",
    "permits": "Everything is scoutable and most things are portageable. One must portage canyon that can be dangerous.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3-5 days for the full run",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "ucona-river-upper",
    "riverId": "ucona-river",
    "name": "Upper",
    "difficultyClass": "Class IV with optional V",
    "description": "Overview: Technical waterfalls through coastal rainforest",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ucona-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:43.002298Z",
    "updatedAt": "2025-11-18T19:12:43.002298Z",
    "season": "During or after rainfall October-March, snowmelt April-June",
    "permits": "You'll be scouting almost everything.",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "white-river-nass-tributary",
    "riverId": "white-river-nass-tributary",
    "name": "White River (Nass tributary)",
    "difficultyClass": "Class IV",
    "description": "Overview: A high volume tributary to the Nass\n\nFlows: The White flows all summer, and likely correlates with the Nass gauge. It is not a small river, as it contributes a decent portion of the Nass directly from the massive Cambria Icefield. High water could get too boily. Information for this description is based on flows of 700cms in September (NASS RIVER ABOVE SHUMAL CREEK 08DB001).\n\nShuttle: The run is located near Meziadin Lake on Highway 37 north of Terrace. There are two takeout options: a lower option at the normal Nass day section takeout at the Arbor FSR bridge, and an upper unmarked option along Highway 37 just north of Moore Creek. The put in should be reached by continuing north, crossing the Nass River on the Meziadin Bridge, and turning left onto Meziadin FSR. Cross the old airstrip and the Meziadin River, then and continue for 16km to the put in at a bridge over the White River. After finishing paddling, the Meziadin River fish ladders are nearby and are worth checking out.\n\nOn the Water: The run starts right away with a boily, read and run, low gradient, class III-IV open canyon, which continues for several kilometers. Somewhere in this first section on a right turn is a pinch rapid that is a bit gross, at normal flows it can be portaged on slabs on river left. Then the river gradually opens up and mellows out to class II for several kilometers. About 1km before the Nass confluence, there is an easy pinch on a sharp left turn. From this pinch down to the Nass are a couple technical class IV rapids. Immediately after the confluence is a sizeable class IV rapid on the Nass. After this rapid look for a waterfall on river left of the Nass (Moore Creek). This is one takeout option, a steep 500m bushwhack out to the highway that is pretty thick but doable. Or, continue downstream on the Nass for more class III-IV rapids down to the normal takeout at the Arbor FSR bridge. In total, the paddle is about 15km on the White River and an additional optional 20km on the Nass River. Meziadin FSR bridge over the White River at the put in. Looking downstream from the put in bridge on the White River. A gross pinch rapid in the first canyon. Technical class IV just above the Nass confluence. Confluence of White (bottom) and Nass (left to right) Rivers.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/white-river-nass-tributary",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:56.093335Z",
    "updatedAt": "2025-11-18T19:12:56.093335Z",
    "putIn": "should be reached by continuing north, crossing the Nass River on the Meziadin Bridge, and turning left onto Meziadin FSR",
    "takeOut": "options: a lower option at the normal Nass day section takeout at the Arbor FSR bridge, and an upper unmarked option along Highway 37 just north of Moore Creek",
    "season": "April to October",
    "permits": "The bigger rapids can be scouted",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "birkenhead-river-lower",
    "riverId": "birkenhead-river",
    "name": "Lower",
    "difficultyClass": "Class III(+), IV if doing the first rapids",
    "description": "Overview: A fun play run with an optional bigger rapid at the start.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/birkenhead-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:26.937052Z",
    "updatedAt": "2025-11-18T19:08:26.937052Z",
    "season": "Summer",
    "permits": "Easy",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "upper-callaghan",
    "riverId": "upper-callaghan",
    "name": "Upper Callaghan",
    "difficultyClass": "Class III+ with one IV- easy waterfall",
    "description": "Overview: Scenic wilderness-feel but not far from a road. Lots to surf!",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/upper-callaghan",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:46.185132Z",
    "updatedAt": "2025-11-18T19:12:46.185132Z",
    "season": "Spring",
    "permits": "Main falls can be inspected",
    "flowUnit": "cms",
    "estimatedTime": "1-1.5 hours depending on your put-in choice",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "downie-canyon",
    "riverId": "downie-canyon",
    "name": "Downie Canyon",
    "difficultyClass": "Class IV with a portage",
    "description": "Overview: A short committing canyon with some fun technical rapids and beautiful scenery",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/downie-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:44.632911Z",
    "updatedAt": "2025-11-18T19:09:44.632911Z",
    "season": "Late fall",
    "permits": "Scouting and portaging are difficult and may require rope work or throw and goes.",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "ashlu-mini-mine",
    "riverId": "ashlu-mini-mine",
    "name": "Ashlu Mini Mine",
    "difficultyClass": "Class IV",
    "description": "Overview: A short intro to Ashlu paddling, bedrock rapids, boulder gardens and optional waterfall.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashlu-mini-mine",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:08.761900Z",
    "updatedAt": "2025-11-18T19:08:08.761900Z",
    "season": "July-September, See Ashlu Release Schedule",
    "permits": "Mostly only boat-scouting required with a few places you can take a look before if you so wish. Everything is scoutable even at higher flows but portaging some rapids would take a great deal of effort. The final waterfall can be scouted from the takeout bridge, or optionally not run.",
    "hazards": [
      "Waterfall"
    ],
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 30.0,
    "flowUnit": "cms",
    "estimatedTime": "20mins - 1 hour",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "puntledge-river-upper",
    "riverId": "puntledge-river",
    "name": "Upper",
    "difficultyClass": "Class V",
    "description": "Overview: A unique section consisting entirely of massive slides. Unpredictable dam releases.\n\nFlows: Flows in the Upper Puntledge are released from the BC Hydro's Comox Dam (PUNTLEDGE RIVER BELOW DIVERSION 08HB084).  Recommended flows for the Upper Puntledge are 80-120cms. BC Hydro provides release forecasts for the Comox Dam for the upcoming 3-4 days on its website. Use the \"Forecast Puntledge River Gauge 6 Flow,\" not the \"Forecast Comox Discharge.\" https://www.bchydro.com/energy-in-bc/operations/transmission-reservoir-data/reservoir-discharges/comox-dam.html The dam releases are most common just before and during big rain events, to make room in the reservoir for the incoming water. Releases are often timed for low tide to prevent flooding in town. High tide or the upcoming end of a storm can sometimes cause the release to end abruptly.  In years past, BC Hydro coordinated a dam release for one weekend in May or June for the Puntledge River Paddle Festival. 2010 hydrograph, maximum, median and minimum flows for the PUNTLEDGE RIVER BELOW DIVERSION (08HB084). The maximum values (green) should give an impression of what time of year the river be more likely to have a dam release. The 2010 values (red) give an example year and also show the unpredictable nature of these releases. An example of the BC Hydro discharge forecast chart. Use the \"Forecast Puntledge River Gauge 6 Flow,\" not the \"Forecast Comox Discharge.\" The difference is going through the pipe.\n\nShuttle: Access to the take out for the Lower Puntledge (III+) is easy, with many options located in downtown Courtenay, a common one being at the bridge on Condensory Road. Access to the put in for the Upper Puntledge (V) is found off Forbidden Plateau Road at Barber's Hole Parking for Nymph Falls Regional Nature Park. From the parking lot, which is located next to a huge field/airstrip, walk ~500m upstream to the southwest along trails and an old road to a put in on river left, just below the diversion dam. The dam release sirens will probably be going off. BC Hydro map of Puntledge recreation area.\n\nOn the Water: Find a guide to show you down. Scouting is not practical due to very long rapids with forested banks, and would often be trespassing on private property. The run consists of several complex and sometimes shallow slides, often with huge ledge holes at the end. Fish ladders have been constructed within many of these slides, and must be avoided. Logs are often sprinkled around the wide riverbed and hung up on the slides. In addition to the slides, there are two notably larger drops: Nymph Falls and Stotan Falls. Located fairly early on in the run, Nymph Falls is usually run down the right channel, which is a steep and fast slide about 10m tall with an undercut right wall. Trails on river left give a partial view of the approach to this slide, but the crux remains out of view behind the island. Further downstream just after the second road bridge (Duncan Bay Mainline), Stotan Falls is a very fun multi-tiered drop run down the left channel: a couple vertical 5m drops combined with holes and slides. Shortly after Stotan Falls, the confluence with the Browns River is on the left, which marks the beginning of the play run. Most paddlers finish by paddling out the Lower Puntledge play run (III+) to Courtenay, watching out for the riverwide weir at the hatchery. The left channel at Nymph Falls is not recommended. The right channel that is usually run is in the far background. Stotan Falls looking downstream.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/puntledge-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:33.666029Z",
    "updatedAt": "2025-11-18T19:11:33.666029Z",
    "putIn": "for the Upper Puntledge (V) is found off Forbidden Plateau Road at Barber's Hole Parking for Nymph Falls Regional Nature Park",
    "takeOut": "for the Lower Puntledge (III+) is easy, with many options located in downtown Courtenay, a common one being at the bridge on Condensory Road",
    "season": "Rare dam releases Oct-June, usually during heavy rains or big snowmelt years.",
    "permits": "Scouting is often not practical due to forested banks and very long rapids.",
    "minRecommendedFlow": 80.0,
    "maxRecommendedFlow": 120.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "skookumchuck",
    "riverId": "skookumchuck",
    "name": "Skookumchuck",
    "difficultyClass": "Class III, massive volume.",
    "description": "Overview: Classic tidal rapid surfing.  Character changes with the speed of the current.  Awesome surroundings.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/skookumchuck",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:56.055800Z",
    "updatedAt": "2025-11-18T19:11:56.055800Z",
    "season": "Spring through fall.  Usually runs during the night in the winter.",
    "permits": "N/A.",
    "flowUnit": "cms",
    "estimatedTime": "The wave will be in good form for 2-4 hours, depending on the tide exchange.",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "homathko-river",
    "riverId": "homathko-river",
    "name": "Homathko River",
    "difficultyClass": "Class V (V+)",
    "description": "Overview: Big water wilderness multiday trip - world class.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/homathko-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:26.524474Z",
    "updatedAt": "2025-11-18T19:10:26.524474Z",
    "season": "Early to late fall.  Spring windows are rare but possible.",
    "permits": "Moderate to difficult, but almost always possible.  There is some must-run whitewater on day 2.",
    "minRecommendedFlow": 150.0,
    "maxRecommendedFlow": 350.0,
    "flowUnit": "cms",
    "stationId": "08GD004",
    "estimatedTime": "4 days.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "cowichan-river-skutz-falls-to-marie-canyon",
    "riverId": "cowichan-river",
    "name": "Skutz Falls to Marie Canyon",
    "difficultyClass": "Class III (IV)",
    "description": "Overview: Consistently flowing class III canyon.\n\nFlows: Runnable flows in the fall, winter, and spring are fairly consistent by Island standards, fed by the large Cowichan Lake. As flows drop into the summer, a weir at the outlet of the lake retains enough water to release at very low levels. At the current summer base flow of ~7cms, the section is still technically runnable, but will very bony and overrun by inner tubers. A better low-medium flow is around 20-30cms. Unexpectedly, Marie Canyon is not a great high water run, and at flows around 100cms many rapids are washed out. 2020 hydrograph and median for COWICHAN RIVER AT LAKE COWICHAN (08HA002).",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cowichan-river-skutz-falls-to-marie-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:38.450153Z",
    "updatedAt": "2025-11-18T19:09:38.450153Z",
    "season": "Year round, but very low during summer.",
    "permits": "Easy except one rapid on a blind corner near the end.",
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 30.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "ashlu-creek-box-canyon",
    "riverId": "ashlu-creek",
    "name": "Box Canyon",
    "difficultyClass": "Class V",
    "description": "Overview: The signature run of southwest BC - clean bedrock in a deep box canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashlu-creek-box-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:04.067231Z",
    "updatedAt": "2025-11-18T19:08:04.067231Z",
    "season": "This river is now dammed - has releases in May, August and September.  Possible when the dam spills over at times of high flow.",
    "permits": "Difficult - impossible to scout or portage in spots.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 16.0,
    "maxRecommendedFlow": 32.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours.  Sub 30 min laps when you know it.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "chilliwack-river-post-creek-to-camp-foley",
    "riverId": "chilliwack-river-post-creek-to-camp-foley",
    "name": "Chilliwack River – Post Creek to Camp Foley",
    "difficultyClass": "Class III+",
    "description": "Overview: Continuous boulder gardens, medium volum, rarely paddled, watch for wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilliwack-river-post-creek-to-camp-foley",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:19.516881Z",
    "updatedAt": "2025-11-18T19:09:19.516881Z",
    "season": "Late spring and early summer, and after rain",
    "permits": "Everything should be easy to scout and reasonable to portage. Prone to accumulate wood.",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "trent-river",
    "riverId": "trent-river",
    "name": "Trent River",
    "difficultyClass": "Class V for the waterfall; III for the paddle out",
    "description": "Overview: Park and huck waterfall and a mellow paddle out to the ocean\n\nFlows: The Trent needs heavy rains to come in. The minumum flow is 15 cms on BROWNS RIVER NEAR COURTENAY (08HB026). This gauge is in a different watershed so is only an approximation. The waterfall will be better higher, maybe around 50cms (see pictures below). For the lower run, the only high water limiting factor is the significant wood hazard.\n\nShuttle: The trail to scout the waterfall is located just south of Cumberland on Highway 19, on the north side of the bridge (river left). There are small pullouts on either side of the freeway, but they come up quick at 110km/h. The trail leaves the highway about 200m north of the bridge, follow it about 400m downstream on river left to the waterfall. The put in for the lower run is at the base of the waterfall, ropework may be needed to lower boats. To get to the takeout, head north on Highway 19 for 4km and take the exit for Cumberland. Turn left onto Cumberland Road, left again on Union Road, and left again onto Royston Road. Follow Royston Road over the highway and all the way down to the beach, where there are several parking options. Another takeout option is the abandoned railway bridge in Royston, this is a bit of a hike from either Cameron Road or Hatton Road.\n\nOn the Water: The put in for the waterfall can either be at the highway or from a branch off the scouting trail.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/trent-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:33.453013Z",
    "updatedAt": "2025-11-18T19:12:33.453013Z",
    "putIn": "for the lower run is at the base of the waterfall, ropework may be needed to lower boats",
    "takeOut": "option is the abandoned railway bridge in Royston, this is a bit of a hike from either Cameron Road or Hatton Road",
    "season": "Oct-April after heavy rains",
    "permits": "Scout the waterfall from the trail beforehand.",
    "hazards": [
      "Waterfall"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours for the full run.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "lillooet-river-between-the-lakes",
    "riverId": "lillooet-river",
    "name": "Between the Lakes",
    "difficultyClass": "Class II/III+ (IV)",
    "description": "Overview: Stunning scenery multi-day option not far from Vancouver.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/lillooet-river-between-the-lakes",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:52.118047Z",
    "updatedAt": "2025-11-18T19:10:52.118047Z",
    "season": "Summer or mid-winter",
    "permits": "Only one rapid which may need inspecting",
    "flowUnit": "cms",
    "estimatedTime": "2-7 hours",
    "difficultyMin": 2,
    "difficultyMax": 4
  },
  {
    "id": "ashlu-creek-play-run",
    "riverId": "ashlu-creek",
    "name": "Play Run",
    "difficultyClass": "Class III+ (IV-)",
    "description": "Overview: Boulder Garden fun which is now sadly tricky to access!",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashlu-creek-play-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:07.140894Z",
    "updatedAt": "2025-11-18T19:08:07.140894Z",
    "season": "Summer/Fall",
    "permits": "Scout the take-out, be aware of wood especially in 2 steeper drops.",
    "hazards": [
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "A big day out",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "rogers-creek",
    "riverId": "rogers-creek",
    "name": "Rogers Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Short run in an amazing gorge - includes the famous triple falls.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/rogers-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:36.709864Z",
    "updatedAt": "2025-11-18T19:11:36.709864Z",
    "season": "July-August - this is a late season run.",
    "permits": "Moderate to difficult.",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours on the water.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "elaho-river-upper",
    "riverId": "elaho-river",
    "name": "Upper",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A late season canyon run with fun whitewater at the end of the road in the Elaho Valley.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/elaho-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:52.940792Z",
    "updatedAt": "2025-11-18T19:09:52.940792Z",
    "season": "Late season - September or later.",
    "permits": "Tough to impossible portage options in a few spots.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "bowser-river",
    "riverId": "bowser-river",
    "name": "Bowser River",
    "difficultyClass": "Class II-III with one long IV+ rapid",
    "description": "Overview: Paddle up close to several glaciers on this chain of lakes.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bowser-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:38.080129Z",
    "updatedAt": "2025-11-18T19:08:38.080129Z",
    "season": "Summer (June-Sept).",
    "permits": "Easy at low water. The crux rapid would get exciting at high water.",
    "minRecommendedFlow": 800.0,
    "flowUnit": "cms",
    "estimatedTime": "3 days",
    "difficultyMin": 2,
    "difficultyMax": 4
  },
  {
    "id": "stawamus-river",
    "riverId": "stawamus-river",
    "name": "Stawamus River",
    "difficultyClass": "Class III (V)",
    "description": "Overview: A short novelty run in Squamish that's fun when everything in the area is running high.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/stawamus-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:15.972768Z",
    "updatedAt": "2025-11-18T19:12:15.972768Z",
    "season": "All year after heavy rain.",
    "permits": "Easy - roadside.",
    "flowUnit": "cms",
    "stationId": "08GA076",
    "estimatedTime": "10-30 mintues.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "cheakamus-paradise-valley",
    "riverId": "cheakamus-paradise-valley",
    "name": "Cheakamus – Paradise Valley",
    "difficultyClass": "Class II (III)",
    "description": "Overview: Fun beginner run\n\nFlows: : Low: 25 cms, Medium: 50 cms, High: 100 cms.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-paradise-valley",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:57.158854Z",
    "updatedAt": "2025-11-18T19:08:57.158854Z",
    "season": "Nearly always runnable",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "clearwater-river-gatling-gorge",
    "riverId": "clearwater-river",
    "name": "Gatling Gorge",
    "difficultyClass": "Class V",
    "description": "Overview: Big water canyon with a lot of flat paddling!",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clearwater-river-gatling-gorge",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:24.055874Z",
    "updatedAt": "2025-11-18T19:09:24.055874Z",
    "season": "Mid to late summer",
    "permits": "All is scoutable but two rapids are must-runs in tight-canyons",
    "flowUnit": "cms",
    "estimatedTime": "4 hours including the Upper Sabretooth section.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "brittania-creek",
    "riverId": "brittania-creek",
    "name": "Brittania Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A roadside double drop park and huck attraction with easy access and a sketchy take out.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/brittania-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:42.998155Z",
    "updatedAt": "2025-11-18T19:08:42.998155Z",
    "season": "After rain or snowmelt - runs frequently.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "1 hour.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "statlu-creek-statlu-canyon",
    "riverId": "statlu-creek",
    "name": "Statlu Canyon",
    "difficultyClass": "Class V at medium levels.",
    "description": "Overview: Short but high quality, creamy smooth granite bedrock and boulders deep in the Fraser Valley.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/statlu-creek-statlu-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:12.687255Z",
    "updatedAt": "2025-11-18T19:12:12.687255Z",
    "season": "After rainfall or snowmelt in early summer.",
    "permits": "Difficult.",
    "flowUnit": "cms",
    "stationId": "08MH103",
    "estimatedTime": "2-3 hours + possible hike in.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "chehalis-river-lower-aka-statlu-chehalis",
    "riverId": "chehalis-river",
    "name": "Lower (aka Statlu-Chehalis)",
    "difficultyClass": "Class III-IV-",
    "description": "Overview: The best intermediate run in the Fraser Valley, down a wilderness canyon",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chehalis-river-lower-aka-statlu-chehalis",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:08.202411Z",
    "updatedAt": "2025-11-18T19:09:08.202411Z",
    "season": "During or after rainfall October-March, snowmelt April-June",
    "permits": "The IV- rapids can be scouted and portaged at low water",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 hour at high water; 4 hours at low water with scouting",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "kicking-horse-river-kicking-horse-rest-area-to-lower-canyon",
    "riverId": "kicking-horse-river",
    "name": "Kicking Horse Rest Area to Lower Canyon",
    "difficultyClass": "Class V",
    "description": "Overview: Continuous, steep river running.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kicking-horse-river-kicking-horse-rest-area-to-lower-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:37.586287Z",
    "updatedAt": "2025-11-18T19:10:37.586287Z",
    "season": "April to November",
    "permits": "Easy scouting and portaging along river right train tracks, but watch out for trains and CP employees.",
    "flowUnit": "cms",
    "estimatedTime": "1 hour if scouting, 15 minute race laps.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "blanket-creek-sutherland-falls",
    "riverId": "blanket-creek-sutherland-falls",
    "name": "Blanket Creek (Sutherland Falls)",
    "difficultyClass": "Class V",
    "description": "Overview: A classic BC park and huck; one of the friendliest and most accessible large waterfalls out there",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/blanket-creek-sutherland-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:33.094820Z",
    "updatedAt": "2025-11-18T19:08:33.094820Z",
    "season": "Early spring/summer and fall with rain",
    "permits": "Easy trails for scouting and portageing",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 second of freefall with 30 minutes of prep",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "troutline-creek",
    "riverId": "troutline-creek",
    "name": "Troutline Creek",
    "difficultyClass": "Class I-II; V+ Canyon Below",
    "description": "Overview: A novelty subalpine float, with stouts downstream left to explore\n\nFlows: Troutline Creek is probably best in early summer, as it is near the headwaters in an unglaciated area. June is probably best for the easy float through the upper valley. Sometime later in the summer, the lower canyons should drop into a reasonable flow, but they probably get too low at some point. The nearest gauge is in a different watershed, but may be helpful for estimating flows (COTTONWOOD RIVER ABOVE BASS CREEK (10AC005)). A flow of ~75cms on this gauge correlated to enough water for the upper float on Troutline Creek, although the lower canyons looked a bit high and were not paddled. Historical Max/Min/Mean Hydrometric Data Graph for COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) [BC]. From a different drainage, but may represent flow conditions in the region.\n\nShuttle: This semi-roadside section is located about 2 hours north of Dease Lake along the road to the abandoned mining town of Cassiar. The take out for the lower canyons is located on the outskirts of Jade City. To get to the put in, drive 2km NE on Highway 37, turn left onto the Cassiar Road, and zero your tripmeter. After ~5.7km, the first bridge is over Quartzrock Creek, but keep going as this creek doesn't look good to go. At ~7.3km, a spur road on the left leads 300m to an intermediate access point on Troutline Creek, which can be used to split the run between the upper class II float and lower class V canyons. At ~12.8km from the highway, a giant pile of asbestos mine tailings will come into view, and a quick left turn towards the airstrip will have a couple put in options.\n\nOn the Water: Putting on near the airstrip, Troutline Creek is a novelty ~5km class I-II float through subapline meadows that should take under an hour. The road is never too far away in this upper section. Make sure to scout a take out point if you are not planning to continue into the lower canyons. Drone flights of the lower canyons showed a few class V (?) drops of varying quality, although flows looked a bit on the high side at ~75cms on COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) in early July 2022. If you have information or photos of running this section feel free to send them in. A successful descent of this lower canyon section of Troutline Creek would mostly be a coincidence of a crew happening to be in the area during the presumably narrow window of appropriate flows. The road is not close to the river for this lower canyon section. Looking upstream at the old Cassiar mill site and asbestos tailings. The road in is on the right, the old airstrip on the left. Looking downstream at the upper Troutline valley. Typical views in the upper Troutline valley. The upper class I-II float on Troutline Creek. Some of the better class V (?) drops that make the lower Troutline Creek canyons look worth paddling. A stouter drop that looks less good to go.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/troutline-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:36.653254Z",
    "updatedAt": "2025-11-18T19:12:36.653254Z",
    "putIn": "options",
    "takeOut": "for the lower canyons is located on the outskirts of Jade City",
    "season": "Summer",
    "permits": "Not necessary on the upper; exploratory on the lower canyon",
    "flowUnit": "cms",
    "estimatedTime": "1 hour for the upper float; exploratory for the lower canyon",
    "difficultyMin": 1,
    "difficultyMax": 5
  },
  {
    "id": "kicking-horse-river-lower-canyon-to-downtown-golden",
    "riverId": "kicking-horse-river",
    "name": "Lower Canyon to Downtown Golden",
    "difficultyClass": "Class IV",
    "description": "Overview: Classic, continuous river running. Fast, surging waves, powerful holes, satisfying eddies to play with.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kicking-horse-river-lower-canyon-to-downtown-golden",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:39.149412Z",
    "updatedAt": "2025-11-18T19:10:39.149412Z",
    "season": "Any time the river isn't frozen.",
    "permits": "Everything can be scouted from the train tracks on river right. At normal flows competent paddlers can boat scout everything.",
    "maxRecommendedFlow": 180.0,
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "iskut-river",
    "riverId": "iskut-river",
    "name": "Iskut River",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A fantastic northern BC multiday with a long hike out.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/iskut-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:29.783534Z",
    "updatedAt": "2025-11-18T19:10:29.783534Z",
    "season": "July to September",
    "permits": "Most rapids can be scouted and portaged with some difficulty.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 400.0,
    "maxRecommendedFlow": 600.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 days",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "elk-river-middle",
    "riverId": "elk-river",
    "name": "Middle",
    "difficultyClass": "Class IV",
    "description": "Overview: Great moderate whitewater in a classic Rockies canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/elk-river-middle",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:56.051534Z",
    "updatedAt": "2025-11-18T19:09:56.051534Z",
    "season": "Spring through fall - runs in the winter in mild years.",
    "permits": "Moderate.",
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 30.0,
    "flowUnit": "cms",
    "stationId": "08NK002",
    "estimatedTime": "2 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "yoho",
    "riverId": "yoho",
    "name": "Yoho",
    "difficultyClass": "Class V",
    "description": "Overview: Classic whitewater in an intimidating canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/yoho",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:13:02.472622Z",
    "updatedAt": "2025-11-18T19:13:02.472622Z",
    "season": "Typically runs in August, however can be caught at runnable flows all summer long and into the late fall if you pay attention to weather and snowpack.",
    "permits": "Scouting is possible for most rapids. The hardest rapid of the run is impossible to portage, some other rapids could be portaged if wood was in play.",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "minRecommendedFlow": 60.0,
    "maxRecommendedFlow": 80.0,
    "flowUnit": "cms",
    "estimatedTime": "~3 hours to show yourself down, 1 hour if you know the lines.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "white-river-canyon",
    "riverId": "white-river",
    "name": "Canyon",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Classic lappable north Island canyon\n\nFlows: There is no online gauge on the White River, but the gauge on the Salmon River near Sayward can help to estimate flows. Appropriate flows happen in the days following rain events in the fall and winter, and more consistently during spring snowmelt. A minimum flow is 50cms on this gauge. At these flows, the White River Canyon is a pool drop class IV section with ample time to catch eddies and scout rapids. Anything over 100cms is getting high, and the river rapidly changes into a class V boily continuous section where scouting and portaging may not always be an option. Keep in mind that the White River is only one of many tributaries to the Salmon River, on which the gauge is located. Also, a certain cms reading may feel higher during snowmelt season, when more water comes from higher up the drainage where the canyon is located. Finally, the riverbed at the put in and takeout is quite wide, while the canyon itself is very tight in places. Judgement is required; if there is a surf wave at the takeout, maybe you should be thinking twice about dropping into a box canyon. 2020 hydrograph and median flows for the Salmon River at Sayward. A guideline is 50-100cms on this gauge as a starting point for good flows in the White River canyon.\n\nShuttle: The takeout is found just over an hour north from Campbell River, by following Highway 19 to Sayward Junction, turning left across from the gas station, doing a little zig zag to find the start of the White River Main which begins with a steep hill, and following this up the river right side of the White River for ~18km to a bridge at the take out (avoid Victoria Main). The put in is ~4.5km further upstream on river left. Once the road gets close to the river again, look for a fisherman's trail down to a rock ledge next to the water. If you hit White River Provincial Park, you've gone too far. Expect to encounter loaded logging trucks, which have the right of way.\n\nOn the Water: After a warm up over some gravel bars, the river quickly canyons up into a boat scoutable class IV rapid. The first major rapid follows shortly after, which is a double drop that is scouted on the right. After, the river forms a committing tube which curves to the right, leading safely to an eddy to scout the second major rapid: a broken ledge boofed or seal launched on the right. The third drop can only be partially scouted, by swimming to a boulder on river left. After checking for wood, the line is just to drop in and hold on through a series of curlers and holes, in what is arguably the crux rapid. A section of fun read and run boogie leads to a riverwide ledge. All that remains is the twisting exit to the canyon, which can be tricky to scout but always gets run anyhow. Easy water quickly brings the takeout bridge, and another lap. The entry to the first major rapid. (photo Raife Gehren) The entry to the first major rapid. The exit from the tube. Seal launching into the second rapid. Running the second rapid at lower flows. Unless you swim and climb your way down the left shore, this is all you can see of the entrance to the third rapid, the crux of the run. Dropping into the crux.  (photo Raife Gehren) Powering through the crux. (photo Raife Gehren) A big ledge towards the end. A typical White River canyon scouting experience. The view upstream from the take out bridge at a medium low level.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/white-river-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:52.932489Z",
    "updatedAt": "2025-11-18T19:12:52.932489Z",
    "putIn": "of the White River Main which begins with a steep hill, and following this up the river right side of the White River for ~18km to a bridge at the take out (avoid Victoria Main)",
    "takeOut": "is found just over an hour north from Campbell River, by following Highway 19 to Sayward Junction, turning left across from the gas station, doing a little zig zag to find the start of the White River",
    "season": "After rainfall October-March, snowmelt April-June",
    "permits": "Scouting involves a lot of scrambling. Portaging often means hiking up and out of the canyon.",
    "minRecommendedFlow": 50.0,
    "maxRecommendedFlow": 100.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours with scouting. 30 minute laps when you know it.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "adam-river",
    "riverId": "adam-river",
    "name": "Adam River",
    "difficultyClass": "Class III+ with one optional V-",
    "description": "Overview: Short quality intermediate granite canyon",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/adam-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:07:58.567057Z",
    "updatedAt": "2025-11-18T19:07:58.567057Z",
    "season": "During or after rainfall October-March, snowmelt April-June",
    "permits": "Easy to portage the crux ledge",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "mcdame-creek",
    "riverId": "mcdame-creek",
    "name": "McDame Creek",
    "difficultyClass": "Class II-III",
    "description": "Overview: An easy roadside creek\n\nFlows: McDame Creek may be runnable all summer, although it will likely be high during freshet (June) and may be painfully low in the late summer. High water would be hazardous due to placer mining debris and cables in the river. July may be best. The nearest gauge is in a different watershed, but may be helpful for estimating flows (COTTONWOOD RIVER ABOVE BASS CREEK (10AC005)). A flow of ~40cms may suggest medium flows on McDame Creek Historical Max/Min/Mean Hydrometric Data Graph for COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) [BC]. From a different drainage, but may represent flow conditions in the region.\n\nShuttle: This roadside section is located about 2 hours north of Dease Lake along the Cassiar Highway (Highway 37), just past Jade City. The section described here begins 5km north of Jade City along Highway 37, at an unmarked campsite on Allan Lake which is 200m off the highway. The takeout is 16km north of Jade City along Highway 37 (AKA 11km downstream from the put in), at the confluence with a small creek marked either as 1st North Fork Creek or Centreville Creek, where the highway approaches within 50m of the river. If you want to do some exploring, it definitely looks possible to put in higher or take out lower, but there are some private cabins and placer mining operations to consider when looking for access.\n\nOn the Water: Putting on Allan Lake is a scenic start with great views of the Cassiar Mountains. The whitewater is not much to write home about, mostly continuous bouncy class II-III with several blind corners and no standout rapids. Keep an eye out for hazards related to placer mining (e.g. cables, old bridges, etc). There are some small cliff banks here and there, but the river never really canyons up. In 2022, this run did not require any wood or debris portages. How many easy creeks in BC can say that?",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/mcdame-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:07.975689Z",
    "updatedAt": "2025-11-18T19:11:07.975689Z",
    "putIn": "higher or take out lower, but there are some private cabins and placer mining operations to consider when looking for access",
    "takeOut": "is 16km north of Jade City along Highway 37 (AKA 11km downstream from the put in), at the confluence with a small creek marked either as 1st North Fork Creek or Centreville Creek, where the highway ap",
    "season": "Summer",
    "permits": "Would not be practical with continuous river character",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "gamsby-river",
    "riverId": "gamsby-river",
    "name": "Gamsby River",
    "difficultyClass": "Class III-V",
    "description": "Overview: Ultra-classic, coastal wilderness multiday.  3 days of white water.  2 days of flat.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gamsby-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:03.975480Z",
    "updatedAt": "2025-11-18T19:10:03.975480Z",
    "season": "Late August, early September.  Getting the correct level is one of the most challenging logistics to this trip.",
    "permits": "All rapids can be scouted/portaged.  Walking the canyons due to high water would be a major undertaking.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "5 days minimum.  6 or 7 are recommended in case of high water portaging or for enjoying the area.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "ryan-river-upper",
    "riverId": "ryan-river",
    "name": "Upper",
    "difficultyClass": "Class V",
    "description": "Overview: Very steep boulder run - a hike-in day trip.  Hard kayaking.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ryan-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:41.674668Z",
    "updatedAt": "2025-11-18T19:11:41.674668Z",
    "season": "Late season: September-October.",
    "permits": "Easy to moderate, at river level.",
    "flowUnit": "cms",
    "estimatedTime": "5-6 hours including the hike in.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "kokish-river",
    "riverId": "kokish-river",
    "name": "Kokish River",
    "difficultyClass": "Class V at medium levels.",
    "description": "Overview: One of the greatest class V runs on the Island.  A lengthy river full of complex boulder rapids in a lush canyon. Unfortunately it is dewatered for an IPP.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kokish-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:47.289770Z",
    "updatedAt": "2025-11-18T19:10:47.289770Z",
    "season": "Runs unpredictably after heavy rain.  4 possible days of releases per year.",
    "permits": "Easy to strenuous river level portaging.",
    "minRecommendedFlow": 15.0,
    "maxRecommendedFlow": 25.0,
    "flowUnit": "cms",
    "estimatedTime": "3-8 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "cascade-creek",
    "riverId": "cascade-creek",
    "name": "Cascade Creek",
    "difficultyClass": "Class IV-V (V+)",
    "description": "Overview: Steep, manky boulder rapids, a good bedrock canyon and some enormous waterfalls at the take out.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cascade-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:54.031681Z",
    "updatedAt": "2025-11-18T19:08:54.031681Z",
    "season": "After rain or early season snowmelt.",
    "permits": "Moderate.",
    "flowUnit": "cms",
    "estimatedTime": "4-5 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "bulkley-canyon",
    "riverId": "bulkley-canyon",
    "name": "Bulkley Canyon",
    "difficultyClass": "Class III+ to IV-",
    "description": "Overview: The Smithers classic run. Big water canyons with 'boogie water' and plenty of catch on the fly waves in between",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bulkley-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:44.602679Z",
    "updatedAt": "2025-11-18T19:08:44.602679Z",
    "season": "Runnable all season once the ice is off. Typically run after freshet recedes (~ mid-late June) until ~ August.",
    "permits": "One Man Crowd and Featherbed rapids can be scouted from river right. Neither portagable at normal water level. Featherbed can be scouted / portaged form river left at low water.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "4-6 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "perry-river",
    "riverId": "perry-river",
    "name": "Perry River",
    "difficultyClass": "Class III-IV",
    "description": "Overview: « Old Faithful » for the revelstoke paddler. One of the first runs to thaw and the last ones to dry up.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/perry-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:27.211106Z",
    "updatedAt": "2025-11-18T19:11:27.211106Z",
    "season": "All spring and summer",
    "permits": "Scouting and portaging are challenging at times but do not require rope work. Only the greatest pf beaters drop their brand new tuna2’s into this river while portaging.",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "beaver-river-kinbasket-canyon",
    "riverId": "beaver-river-kinbasket-canyon",
    "name": "Beaver River (Kinbasket Canyon)",
    "difficultyClass": "Class IV/IV+",
    "description": "Overview: Early season warm up run with a linear class I to IV+ progression.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/beaver-river-kinbasket-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:13.597013Z",
    "updatedAt": "2025-11-18T19:08:13.597013Z",
    "season": "Early Spring",
    "permits": "Everything is scoutable (the 2nd drop of the double drop is hard to get a really good look at)",
    "flowUnit": "cms",
    "stationId": "08NB019",
    "estimatedTime": "2 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "upper-soo",
    "riverId": "upper-soo",
    "name": "Upper Soo",
    "difficultyClass": "Class III (with a major portage, and quite a bit of flat water)",
    "description": "Overview: Majestic tributary valley to the Whistler region.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/upper-soo",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:49.371182Z",
    "updatedAt": "2025-11-18T19:12:49.371182Z",
    "season": "Sprint to late Summer",
    "permits": "Soo River Falls is a large multi-stage waterfall that has it's own little park on the maps.  Very obvious.",
    "hazards": [
      "Waterfall"
    ],
    "flowUnit": "cms",
    "estimatedTime": "10 - 20 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "toby-creek-7-canyons",
    "riverId": "toby-creek",
    "name": "7 Canyons",
    "difficultyClass": "Mostly class IV/IV+ with one definite class V that can be portaged",
    "description": "Overview: Beautiful class IV+ creeking that just keeps going and going! Easy access, minimal portaging, clean rapids and just enough spice to keep you focused.\n\nFlows: Since there is no online gauge or stick gauge it is a little tricky to know when this river is in. If it looks well within its banks, clear and even a little bony in the flatter/wider parts that you can see from the road it is most likely in. If it looks really bony it probably is. If it looks fast and full then it is almost certainly too high. The level is easier to tell from the put in than the takeout since it is so wide and meandering at the takeout.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/toby-creek-7-canyons",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:31.779431Z",
    "updatedAt": "2025-11-18T19:12:31.779431Z",
    "season": "Later in the summer as water levels come down. Usually a later July to early August run, but can come in at other times.",
    "permits": "Everything can be scouted and the only true class V can be portaged. One of the other biggest rapids on the run gets very tricky (maybe impossible) to portage at high water",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "Full day to show yourself down for the first time, half day if you know it.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "white-river-lower",
    "riverId": "white-river",
    "name": "Lower",
    "difficultyClass": "Class III",
    "description": "Overview: A good intermediate canyon right off the north Island highway",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/white-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:54.502613Z",
    "updatedAt": "2025-11-18T19:12:54.502613Z",
    "season": "During or after rainfall October-March, snowmelt April-June",
    "permits": "Read and run in a canyon. Scouting and portaging may involve scrambling and bushwhacking but are not necessary.",
    "flowUnit": "cms",
    "estimatedTime": "1-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "clearwater-river-play-run",
    "riverId": "clearwater-river",
    "name": "Play Run",
    "difficultyClass": "Class III+ (IV)",
    "description": "Overview: The Ottawa of BC? Big volume, warm, playboating with big rapids.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clearwater-river-play-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:25.705929Z",
    "updatedAt": "2025-11-18T19:09:25.705929Z",
    "season": "All Summer into Fall",
    "permits": "Scouting is possible but portaging would be harder than running everything",
    "flowUnit": "cms",
    "stationId": "08LA001",
    "estimatedTime": "1 hour - many hours if you want to play!",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "gordon-river-upper-gordon",
    "riverId": "gordon-river",
    "name": "Upper Gordon",
    "difficultyClass": "Class IV at medium water.",
    "description": "Overview: Bedrock pool-drop.  Fun, clean rapids and clear water.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gordon-river-upper-gordon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:11.859351Z",
    "updatedAt": "2025-11-18T19:10:11.859351Z",
    "season": "After rain, all year.  Best chance in the fall and winter.",
    "permits": "Easy to moderate.",
    "minRecommendedFlow": 4.0,
    "maxRecommendedFlow": 6.0,
    "flowUnit": "cms",
    "estimatedTime": "2 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "elk-river-upper",
    "riverId": "elk-river",
    "name": "Upper",
    "difficultyClass": "Class V",
    "description": "Overview: A short, stout run with challenging rapids and a clean 35 foot waterfall.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/elk-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:57.635985Z",
    "updatedAt": "2025-11-18T19:09:57.635985Z",
    "season": "Low water - early spring and late summer/fall.",
    "permits": "Easy scouting.  The biggest rapid has a tough but doable portage route.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 25.0,
    "flowUnit": "cms",
    "estimatedTime": "2 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "similkameen-river-bromley-to-stemwinder",
    "riverId": "similkameen-river",
    "name": "Bromley to Stemwinder",
    "difficultyClass": "Class II (III)",
    "description": "Overview: Great novice run with warmer water than the coast",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/similkameen-river-bromley-to-stemwinder",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:52.830373Z",
    "updatedAt": "2025-11-18T19:11:52.830373Z",
    "season": "Late Spring, early summer",
    "permits": "Easy",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "ashnola-river",
    "riverId": "ashnola-river",
    "name": "Ashnola River",
    "difficultyClass": "Class IV",
    "description": "Overview: Continuous river running in the hot and sunny Okanagan area of south central BC.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashnola-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:10.394772Z",
    "updatedAt": "2025-11-18T19:08:10.394772Z",
    "season": "Early season high water snowmelt in May/June.",
    "permits": "Easy - roadside.",
    "flowUnit": "cms",
    "stationId": "08NL004",
    "estimatedTime": "1-3 hours.  Fast laps on the lower 6 km take 30 min.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "moyeha-river",
    "riverId": "moyeha-river",
    "name": "Moyeha River",
    "difficultyClass": "Scenic I-III packrafting, or manky IV-V creeking",
    "description": "Overview: A difficult traverse of a pristine watershed\n\nFlows: Look for the Gold (GOLD RIVER BELOW UCONA RIVER (08HC001)) to be around 100cms off snowmelt for a medium low kayaking level on the Moyeha, which can usually be found during spring snowmelt in May or June, depending on the snow year. 50cms on the Gold should be adequate for packrafting.\n\nShuttle: The shuttle is 5 hours each way, so you are going to want to find a shuttle driver or two. Start the hike at Jim Mitchell Lake, just beyond the Bedwell Lakes trailhead in Strathcona Provincial Park, found past the south end of Buttle Lake by branching off BC Highway 28 NW of Campbell River. Takeout is by chartered water taxi from the Moyeha River mouth to Tofino, at the terminus of BC Highway 4.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/moyeha-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:14.466779Z",
    "updatedAt": "2025-11-18T19:11:14.466779Z",
    "putIn": "the hike at Jim Mitchell Lake, just beyond the Bedwell Lakes trailhead in Strathcona Provincial Park, found past the south end of Buttle Lake by branching off BC Highway 28 NW of Campbell River",
    "takeOut": "of Buttle Lake by branching off BC Highway 28 NW of Campbell River",
    "season": "Spring snowmelt - May-June",
    "permits": "Don't ask",
    "flowUnit": "cms",
    "estimatedTime": "3-4 days",
    "difficultyMin": 1,
    "difficultyMax": 5
  },
  {
    "id": "granite-creek-tulameen",
    "riverId": "granite-creek-tulameen",
    "name": "Granite Creek (Tulameen)",
    "difficultyClass": "Class IV+ (P)",
    "description": "Overview: A decent low volume canyon run, but not recommended due to very dangerous mining adits\n\nFlows: The Tulameen watershed is on the dry side of the Coast Mountains, and the snowmelt season usually only lasts a few weeks in May and June. Granite Creek does not have a gauge, but at the takeout bridge the creek should look like you can get down without bumping rocks too much, but it shouldn't look high. The canyons upstream narrows to 3m width in places. There should be a decent correlation with the Tulameen gauges: a medium-low flow on Granite Creek equated to 20cms on Tulameen below Vuich Creek and 60cms on Tulameen at Princeton.\n\nShuttle: The takeout is at Granite Creek Recreation Site just outside of Coalmont, which can be reached by a paved roads branching off Highway 3 in Princeton. Total driving time from Vancouver is 4 hours. The Tulameen zone can also be accessed from the Coquihalla Highway via forest service roads. To get to the put in, drive up Granite/Blakeburn FSR on river left for ~6km to the ghost town of Blakeburn. Here, bear left onto Arrastra FSR which switchbacks down to Blakeburn Creek. The safest put in is at the confluence of Blakeburn Creek (too small to paddle) and Granite Creek, but you will have to find a way to bushwhack down to that point. Or, for the most whitewater, keep driving upstream to a a pullout on the left 300m past a bridge over Newton Creek, where a trail leads down to near the confluence of Newton Creek and Granite Creek. This put in is below the logjams and at the start of the whitewater, but above the a dangerous mining tunnel. A final option is to put in where the Arrastra FSR drops down to creek level, but by putting in here you will have to deal with a few sketchy logjams as well as the dangerous tunnel.\n\nOn the Water: From this uppermost put in, where Granite Creek is roadside, the paddle starts as wood choked class III-IV down to Newton Creek. From Newton Creek down to the Tulameen, Granite Creek alternates between continuous class III+, tight class IV boulder drops, and four narrow canyons. Boat scouting is often possible, but you will frequently be catching one-boat eddies or grabbing willow branches to scramble up and scout around corners and down into canyons. The canyons come up quickly. Wood portages are likely, but the creek is not a wood-choked disaster. The first canyon is a committing narrows that may be difficult to portage, but contains only one easy ledge. The second canyon is extremely dangerous, as most of the river goes underground in an abandoned placer mining drain tunnel, and it is not easy to spot this feature or to stop above it. Putting on above this feature is not recommended. If you do, it is possible to get out well above the feature, and portage on river left up and over a ridge down into Blakeburn Creek, but this will probably take over an hour. Portaging at river level may be possible, but there is significant exposure to the drain. Below the adit, and a mostly dewatered section, the second canyon appears to consist of a boxed in series of ledge holes, although this was not paddled. At some point in the second canyon the water re-enters Granite Creek through the exit of the mine tunnel. This whole mess can be avoided by putting on at the confluence of Blakeburn Creek and Granite Creek. Below Blakeburn Creek, the third canyon is quite narrow and has a series of runnable ledge holes. If necessary, it can be portaged along a narrow ledge on river right about 20m above river level. The fourth canyon contains a boulder sluice into an excellent 4m waterfall into a huge pool. Portaging this one (on the right) is probably sketchier than just running it. From here the difficulty eases up to the takeout, and it's easiest just to take out at the rec site on the Tulameen River. An old cabin near the confluence of Newton and Granite Creeks.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/granite-creek-tulameen",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:16.689704Z",
    "updatedAt": "2025-11-18T19:10:16.689704Z",
    "putIn": "is at the confluence of Blakeburn Creek (too small to paddle) and Granite Creek, but you will have to find a way to bushwhack down to that point",
    "takeOut": "is at Granite Creek Recreation Site just outside of Coalmont, which can be reached by a paved roads branching off Highway 3 in Princeton",
    "season": "Late Spring - May-June",
    "permits": "Lots of scrambling to scout canyons. Portaging at river level often not possible.",
    "flowUnit": "cms",
    "estimatedTime": "Up to 8 hours for a first run. Probably one hour to bomb it.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "heber-river-lower",
    "riverId": "heber-river",
    "name": "Lower",
    "difficultyClass": "Class IV-V (P)",
    "description": "Overview: A box canyon ending at a baseball diamond",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/heber-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:23.100582Z",
    "updatedAt": "2025-11-18T19:10:23.100582Z",
    "season": "After rainfall October-March, snowmelt April-June",
    "permits": "Not a bad idea to scout the crux rapid before putting on.",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "clore-river-grand-canyon",
    "riverId": "clore-river",
    "name": "Grand Canyon",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A classic fly in multiday.  Steep, continuous rapids in a deep canyon with cheap and easy logistics.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clore-river-grand-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:32.112225Z",
    "updatedAt": "2025-11-18T19:09:32.112225Z",
    "season": "August and September.",
    "permits": "Everything can be scouted and portaged.  The day of whitewater is long and there is often the need for some aggressive boat scouting.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 100.0,
    "maxRecommendedFlow": 150.0,
    "flowUnit": "cms",
    "stationId": "08EF005",
    "estimatedTime": "2 or 3 days.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "bobbie-burns-creek-into-spillimacheen-river",
    "riverId": "bobbie-burns-creek-into-spillimacheen-river",
    "name": "Bobbie Burns Creek into Spillimacheen River",
    "difficultyClass": "Class III+ to IV (V)",
    "description": "Overview: Lovely class 4 river running. Starts out as boulder gardens, slowly changing into bedrock rapids as the run progresses.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bobbie-burns-creek-into-spillimacheen-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:34.694500Z",
    "updatedAt": "2025-11-18T19:08:34.694500Z",
    "season": "June-August",
    "permits": "Everything can be boat scouted except for the 30 foot waterfall a few km into the run. Easy to scout and portage on river left.",
    "hazards": [
      "Portage required",
      "Waterfall"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours of on water time",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "koksilah-river-canyon",
    "riverId": "koksilah-river",
    "name": "Canyon",
    "difficultyClass": "Class III-IV",
    "description": "Overview: A good introductory creeking run near Victoria",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/koksilah-river-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:48.899010Z",
    "updatedAt": "2025-11-18T19:10:48.899010Z",
    "season": "October-April during or after rain",
    "permits": "Mostly reasonable to scout and portage, Marble Falls is tricky.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 30.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "lower-mamquam",
    "riverId": "lower-mamquam",
    "name": "Lower Mamquam",
    "difficultyClass": "Class II+",
    "description": "Overview: Good beginner run with small rock garden",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/lower-mamquam",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:56.712496Z",
    "updatedAt": "2025-11-18T19:10:56.712496Z",
    "season": "Snowmelt until summer, fall after rain",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 2,
    "difficultyMax": 2
  },
  {
    "id": "tingle-creek",
    "riverId": "tingle-creek",
    "name": "Tingle Creek",
    "difficultyClass": "Class II-III",
    "description": "Overview: Beautiful clear turquoise waters, south of the Stave Valley.  The secluded Tingle Valley runs between Mount Robbie Reid, and the Justice Group (Judge Howay & The Defendant).",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tingle-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:30.340072Z",
    "updatedAt": "2025-11-18T19:12:30.340072Z",
    "season": "Spring/Early Summer",
    "permits": "Mostly boat scout-able, but quite a bit a wood.",
    "hazards": [
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "4 hours, but there are considerable logistics in accessing and leaving the river.",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "chilko-bidwell-to-taseko",
    "riverId": "chilko",
    "name": "Bidwell to Taseko",
    "difficultyClass": "Class IV-",
    "description": "Overview: Remote, beautiful clear water, big volume.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilko-bidwell-to-taseko",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:15.134761Z",
    "updatedAt": "2025-11-18T19:09:15.134761Z",
    "season": "Summer and Late Summer",
    "permits": "Easy scouting for major rapids",
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "stikine-tahltan-to-telegraph",
    "riverId": "stikine",
    "name": "Tahltan to Telegraph",
    "difficultyClass": "Class II-III",
    "description": "Overview: A mellow way to experience the runout of the Grand Canyon Stikine\n\nFlows: Information for this description is based on flows of 250-500cms (Stikine River at Telegraph Creek). The section is likely runnable higher, although boils could become an issue, as well as other high water risks. Also, locals say the river doesn't freeze much in winter anymore, so off season low water descents may be possible as well.\n\nShuttle: The run is located about 2 hours west of Dease Lake on the Telegraph Creek Road (BC Highway 51). The put in is at the confluence of the Tahltan and Stikine Rivers. This is an important cultural and fishing site for the Tahltan, so be respectful. The takeout is a further 20km downstream at the town of Telegraph Creek. The Riversong Cafe in Telegraph Creek may be able to provide a shuttle service, and also has camping, meals and accommodation. The run could be extended another 20km of flatwater down to Glenora, where the road ends.\n\nOn the Water: Much of the run is in a steep sided, craggy and loose canyon. At normal levels the whitewater is pretty straightforward class II-III wave trains and boily eddies, as well as a fair amount of flatwater. A couple of the bigger rapids are on left bends. For comparison, the volume and style of the whitewater is similar to the Thompson River, but a half grade easier. Keep an eye out for a nice waterfall at Seven Mile Creek. The Water Survey gauge cable is about 1km above the takeout at Telegraph Creek.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/stikine-tahltan-to-telegraph",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:19.133967Z",
    "updatedAt": "2025-11-18T19:12:19.133967Z",
    "putIn": "is at the confluence of the Tahltan and Stikine Rivers",
    "takeOut": "is a further 20km downstream at the town of Telegraph Creek",
    "season": "All summer.",
    "permits": "Sometimes possible. Big canyon.",
    "minRecommendedFlow": 250.0,
    "maxRecommendedFlow": 500.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "tatlow-creek",
    "riverId": "tatlow-creek",
    "name": "Tatlow Creek",
    "difficultyClass": "Class V",
    "description": "Overview: One of the best class V runs in SW BC.  Waterfalls, slides, electric blue water and difficult access.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tatlow-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:25.722151Z",
    "updatedAt": "2025-11-18T19:12:25.722151Z",
    "season": "Late season run, usually in August.",
    "permits": "Difficult to virtually impossible.  One common portage requires ropes to lower boats and down climb.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "4-6 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "granite-creek",
    "riverId": "granite-creek",
    "name": "Granite Creek",
    "difficultyClass": "Class V",
    "description": "Overview: Waterfalls.  A great waterfall run with some boulder rapids and a lot of wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/granite-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:15.101851Z",
    "updatedAt": "2025-11-18T19:10:15.101851Z",
    "season": "After rain in the fall and winter.",
    "permits": "Scouting is reasonable but portaging can be hard.  The biggest drop is not readily portaged.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "stationId": "08HA069",
    "estimatedTime": "5-8 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "cheakamus-river-cal-cheak-callaghan-into-cheakamus",
    "riverId": "cheakamus-river",
    "name": "Cal-Cheak (Callaghan into Cheakamus)",
    "difficultyClass": "Class III",
    "description": "Overview: A great short run for intermediate paddlers with some fun surf waves at higher flows",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-cal-cheak-callaghan-into-cheakamus",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:00.389125Z",
    "updatedAt": "2025-11-18T19:09:00.389125Z",
    "season": "Spring-Fall",
    "permits": "Easy, but make sure you know where the takeout is!",
    "flowUnit": "cms",
    "estimatedTime": "20-45mins",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "seton-river",
    "riverId": "seton-river",
    "name": "Seton River",
    "difficultyClass": "Class II+",
    "description": "Overview: A quick cool down in Lillooet.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/seton-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:43.445542Z",
    "updatedAt": "2025-11-18T19:11:43.445542Z",
    "season": "April-September. BC Hydro flow regulated.",
    "permits": "Read and run",
    "flowUnit": "cms",
    "estimatedTime": "30 minutes",
    "difficultyMin": 2,
    "difficultyMax": 2
  },
  {
    "id": "snowcap-creek",
    "riverId": "snowcap-creek",
    "name": "Snowcap Creek",
    "difficultyClass": "Class III-V",
    "description": "Overview: An obscure run near Rogers Creek with good whitewater and a short, hard to scout canyon in the middle.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/snowcap-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:03.732526Z",
    "updatedAt": "2025-11-18T19:12:03.732526Z",
    "season": "A glacial fed river, it runs later in the season - July and August are the best bet.",
    "permits": "Easy to very difficult.  Dealing with the canyon is a significant challenge.",
    "flowUnit": "cms",
    "estimatedTime": "3-6 hours.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "gilttoyees-creek",
    "riverId": "gilttoyees-creek",
    "name": "Gilttoyees Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Coastal wilderness adventure with breathtaking scenery.  The whitewater is good but not classic.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gilttoyees-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:05.607021Z",
    "updatedAt": "2025-11-18T19:10:05.607021Z",
    "season": "Late August.",
    "permits": "There are no canyons and everything can be scouted and portaged.  There's a fair bit of walking if you don't paddle the class V parts.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 days.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "skookum-creek",
    "riverId": "skookum-creek",
    "name": "Skookum Creek",
    "difficultyClass": "Class V",
    "description": "Overview: Big, clean waterfalls and tight canyons.\n\nFlows: As of 2021, we have access to a gauge for Skookum Creek. This gauge is located just below the dam and represents the flow in the diversion reach -- what we kayak. We are still working to establish minimums and maximums but 8-15cms is a good starting point with 8 being quite low and 15 being higher than most would want it. Currently, the gauge updates once daily, but in the future we expect to gain access to more regular (hourly) updates.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/skookum-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:59.091878Z",
    "updatedAt": "2025-11-18T19:11:59.091878Z",
    "season": "Peak snowmelt or after heavy rain when the diversion dam is overflowing.  Flows are usually changing quickly.",
    "permits": "Difficult to almost impossible - it's easier to just walk out if you want to portage the big stuff.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 8.0,
    "maxRecommendedFlow": 15.0,
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours, or more.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "gun-creek",
    "riverId": "gun-creek",
    "name": "Gun Creek",
    "difficultyClass": "Class III-IV.  Slightly stressful because of wood, and a lack of good eddies.",
    "description": "Overview: A 12 km long rapid.  Very continuous and splashy whitewater in a beautiful part of BC.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gun-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:19.873909Z",
    "updatedAt": "2025-11-18T19:10:19.873909Z",
    "season": "High water snowmelt season in May and June. July is possible in big snow years.",
    "permits": "Easy to moderate.",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "callaghan-creek",
    "riverId": "callaghan-creek",
    "name": "Callaghan Creek",
    "difficultyClass": "Class IV-V at medium levels.",
    "description": "Overview: Whistler's ultra classic.  Clean waterfalls, bedrock and boulder gardens.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/callaghan-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:46.198034Z",
    "updatedAt": "2025-11-18T19:08:46.198034Z",
    "season": "Reliable season from May through August - runs after rain in the off season.",
    "permits": "Relatively easy, except for portaging the big falls.",
    "flowUnit": "cms",
    "estimatedTime": "30 minutes to a few hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "hirsch-creek",
    "riverId": "hirsch-creek",
    "name": "Hirsch Creek",
    "difficultyClass": "Class V",
    "description": "Overview: Great whitewater with a deep and committing canyon.  Beautiful scenery.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/hirsch-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:24.719846Z",
    "updatedAt": "2025-11-18T19:10:24.719846Z",
    "season": "May-October, when other creeks in the area are getting low.",
    "permits": "Triple Drop portage requires ropework.  Patapult is a must run class V deep in a sheer walled canyon.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "lower-pingston",
    "riverId": "lower-pingston",
    "name": "Lower Pingston",
    "difficultyClass": "Class V",
    "description": "Overview: Hard charging BC creeking at its gnarliest. Hectic continuous class 5 with even scarier portages. Often full of wood. An absolute treat on its own or as the finisher to a long day of Pingston paddling.\n\nFlows: This page now shows flow information directly from Pingston dam at the top, but we are still working to understand the correlation between that gauge and runnability. The old correlation was based on the Cranberry Creek gauge : flows between 5 and 10cms are generally a good indicator.\n\nShuttle: Start from the bridge or continue down from the middle takeout. Leave your car at the beach by the lake. The turn off is pretty obvious on google maps. It's the only road off the Shelter Bay Main Line for 5k.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/lower-pingston",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:58.295852Z",
    "updatedAt": "2025-11-18T19:10:58.295852Z",
    "putIn": "from the bridge or continue down from the middle takeout",
    "season": "Early spring or late June",
    "permits": "Scouting and portaging is difficult and may require rope work or confident scrambling abilities",
    "flowUnit": "cms",
    "stationId": "08NE123",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "iskut-river-kinaskan-lake-down",
    "riverId": "iskut-river",
    "name": "Kinaskan Lake down",
    "difficultyClass": "Class II",
    "description": "Overview: An easy roadside float\n\nFlows: This section should be runnable all summer, it will be continuous during snowmelt in June. ISKUT RIVER AT OUTLET OF KINASKAN LAKE (08CG003). Gauge inactive.\n\nShuttle: The run is located about 2 hours south of Dease Lake on Highway 37. The put in is on the lake at Kinaskan Lake Provincial Park campground. The takeout is 7km further south on Highway 37, at a trailhead for Natadesleen Lake. It's about a 1km hike out from Natadesleen Lake back to the highway.\n\nOn the Water: Paddle 1km west from the campground to the Iskut River outlet from Kinsaskan Lake. The 7km section down to Natadesleen Lake has calm sections, swift sections, and a few boulders to avoid. BC Parks lists this as a canoeing section. On Natadelseen Lake, paddle 1km southwest and look for the Lower Cascade Falls Trail on river right at the outlet. Do not paddle into the Iskut River below Natadelseen Lake, as Cascade Falls is just downstream. Cascade Falls should be considered unrunnable, although there is a rumour of a well known kayaker having a go at the left channel. After hiking to Cascade Falls and back, paddle 1km east across Natadesleen Lake, and hike 1km back to the highway along a trail and some boardwalks. BC Parks",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/iskut-river-kinaskan-lake-down",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:31.438792Z",
    "updatedAt": "2025-11-18T19:10:31.438792Z",
    "putIn": "is on the lake at Kinaskan Lake Provincial Park campground",
    "takeOut": "is 7km further south on Highway 37, at a trailhead for Natadesleen Lake",
    "season": "Summer",
    "permits": "Scouting not necessary. 1km portage from takeout back to the highway.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours",
    "difficultyMin": 2,
    "difficultyMax": 2
  },
  {
    "id": "upper-tulameen",
    "riverId": "upper-tulameen",
    "name": "Upper Tulameen",
    "difficultyClass": "Class III-V",
    "description": "Overview: Remote, wilderness feel; low-volume canyons",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/upper-tulameen",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:51.239678Z",
    "updatedAt": "2025-11-18T19:12:51.239678Z",
    "season": "May - June",
    "permits": "Everything is scoutable and/or portageable, but some portages are steep and brushy.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 15.0,
    "maxRecommendedFlow": 20.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 days for the full run, 3-5 hours per section.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "chilliwack-canyon-camp-foley-to-slesse",
    "riverId": "chilliwack-canyon",
    "name": "Camp Foley to Slesse",
    "difficultyClass": "Class III-IV low, IV- medium, IV high",
    "description": "Overview: Pool-drop at low and medium, continuous at higher levels, bedrock and boulder gardens, medium volume river",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilliwack-canyon-camp-foley-to-slesse",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:16.606357Z",
    "updatedAt": "2025-11-18T19:09:16.606357Z",
    "season": "Year round, may be too low in winter and late summer if it does not rain.",
    "permits": "Everything is easy to scout and portage. Check 'Mel's' for wood.",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "trout-creek",
    "riverId": "trout-creek",
    "name": "Trout Creek",
    "difficultyClass": "Class IV+",
    "description": "Overview: A microcreeking epic in wine country, tragically clogged with wood",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/trout-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:35.052236Z",
    "updatedAt": "2025-11-18T19:12:35.052236Z",
    "season": "May-June, after peak freshet",
    "permits": "Scout the canyon under the Trout Creek Trestle before putting on. Everything else can be figured out near river level.",
    "minRecommendedFlow": 5.0,
    "maxRecommendedFlow": 10.0,
    "flowUnit": "cms",
    "estimatedTime": "4 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "white-river-upper",
    "riverId": "white-river",
    "name": "Upper",
    "difficultyClass": "Class III-IV (P)",
    "description": "Overview: Moderate whitewater but with a difficult portage. The fly in the ointment of the White River drainage",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/white-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:57.649661Z",
    "updatedAt": "2025-11-18T19:12:57.649661Z",
    "season": "After rainfall October-March, snowmelt April-June",
    "permits": "Scouting the portage rapid at the takeout is recommended before committing to this run.",
    "hazards": [
      "Portage required"
    ],
    "maxRecommendedFlow": 50.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "khtada-river",
    "riverId": "khtada-river",
    "name": "Khtada River",
    "difficultyClass": "Class V",
    "description": "Overview: A classic North Coast hike in mission. Large bedrock slides and rapids in the rainforest.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/khtada-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:34.470255Z",
    "updatedAt": "2025-11-18T19:10:34.470255Z",
    "season": "May/June for the main runoff season.  Responds well to rainfall.",
    "permits": "All rapids can be easily scouted and portaged.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "Day mission.  30 min paddle across Skeena, and a few hours each of hiking and paddling.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "elaho-river-fear-canyon",
    "riverId": "elaho-river",
    "name": "Fear Canyon",
    "difficultyClass": "Class IV-V depending on level",
    "description": "Overview: A big river with many faces.  Best known as a class IV-V big water run.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/elaho-river-fear-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:51.348420Z",
    "updatedAt": "2025-11-18T19:09:51.348420Z",
    "season": "Year round (often snowed in during winter).",
    "permits": "Scouting is ok.  One of the biggest rapids is a must-run.",
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 40.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "green-river-middle",
    "riverId": "green-river",
    "name": "Middle",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Surprisingly good whitewater on a Whistler run that sees little traffic.  Often tragically infested with wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/green-river-middle",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:18.272899Z",
    "updatedAt": "2025-11-18T19:10:18.272899Z",
    "season": "Mid-season snowmelt - June through early August.",
    "permits": "Easy to moderate.",
    "flowUnit": "cms",
    "estimatedTime": "3-5 hours.  It's hard to bomb because of the constant threat of wood.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "norrish-creek",
    "riverId": "norrish-creek",
    "name": "Norrish Creek",
    "difficultyClass": "Class IV-IV+ at medium levels.  Mainly class III-IV but one unportagable rapid is tricky and dangerous.",
    "description": "Overview: Clean-ish boulders and bedrock with some very tight and deep canyons.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/norrish-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:22.421958Z",
    "updatedAt": "2025-11-18T19:11:22.421958Z",
    "season": "After rain or spring snowmelt.",
    "permits": "Usually easy, however 2 rapids including the hardest can't be walked.",
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "stave-river",
    "riverId": "stave-river",
    "name": "Stave River",
    "difficultyClass": "Class V (V+ to VI)",
    "description": "Overview: Stout southwest BC multi-day kayaking.  There's unrealized opportunity to go big in there.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/stave-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:14.459292Z",
    "updatedAt": "2025-11-18T19:12:14.459292Z",
    "season": "Late season, August or September.",
    "permits": "Easy to long and very difficult.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 days.",
    "difficultyMin": 5,
    "difficultyMax": 6
  },
  {
    "id": "prospect-creek",
    "riverId": "prospect-creek",
    "name": "Prospect Creek",
    "difficultyClass": "Class IV",
    "description": "Overview: A creeky alternate entrance to Spius Creek; scenic but manky",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/prospect-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:32.049817Z",
    "updatedAt": "2025-11-18T19:11:32.049817Z",
    "season": "Snowmelt May-June",
    "permits": "You can scout almost the entire canyon from the rim ahead of time.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "furry-creek",
    "riverId": "furry-creek",
    "name": "Furry Creek",
    "difficultyClass": "Class V-V+",
    "description": "Overview: Short and stout park-n-huck waterfalls.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/furry-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:02.330738Z",
    "updatedAt": "2025-11-18T19:10:02.330738Z",
    "season": "Can be hard to catch because of a tight flow window - after rain or snowmelt all year.",
    "permits": "Scouting is easy.  You either run it or you don't.",
    "flowUnit": "cms",
    "estimatedTime": "1 hour.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "wilson-fitzstubbs-creek",
    "riverId": "wilson-fitzstubbs-creek",
    "name": "Wilson/Fitzstubbs Creek",
    "difficultyClass": "Class III-V",
    "description": "Overview: A beautiful class fun paddling destination for all skill levels.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/wilson-fitzstubbs-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:13:00.867696Z",
    "updatedAt": "2025-11-18T19:13:00.867696Z",
    "season": "All spring",
    "permits": "Scouting is easy. Portaging is difficult and involves ropework on some of the upper sections.",
    "flowUnit": "cms",
    "estimatedTime": "Approx 1 hour per section.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "small-river",
    "riverId": "small-river",
    "name": "Small River",
    "difficultyClass": "Class III-IV (optional V at put in)",
    "description": "Overview: A Small River packed with big fun! Continuous class 3, be on the lookout for wood",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/small-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:02.117031Z",
    "updatedAt": "2025-11-18T19:12:02.117031Z",
    "season": "June-July",
    "permits": "Most of the river is visible from the road. The fast continuous nature of the river makes scouting difficult.",
    "flowUnit": "cms",
    "estimatedTime": "30 mins/lap (trick is to do a bunch of laps!)",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "cheakamus-river-cheakamus-lake-down",
    "riverId": "cheakamus-river",
    "name": "Cheakamus Lake Down",
    "difficultyClass": "Continuous III+",
    "description": "Overview: Paddle out of a beautiful mountain lake into a continuous braided river full of wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-cheakamus-lake-down",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:01.988426Z",
    "updatedAt": "2025-11-18T19:09:01.988426Z",
    "season": "Early or late summer - May, August, September. Peak snowmelt not recommended.",
    "permits": "No scouting necessary, but wood portages likely.",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "stationId": "08GA072",
    "estimatedTime": "2-3 hours including hike in",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "pingston-middle",
    "riverId": "pingston",
    "name": "Middle",
    "difficultyClass": "Class IV with a short V section at the end",
    "description": "Overview: Excellent quality class 4 with a few bigger rapids near the end. Continuous without being pushy, clean read and run for the first 3/4 with reasonably easy scouting and portaging options for the bigger rapids",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/pingston-middle",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:28.701462Z",
    "updatedAt": "2025-11-18T19:11:28.701462Z",
    "season": "Early July",
    "permits": "Lots of eddies and reasonably easy scouting/portaging at river level (no canyon sections)",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours (more or less depending on your boat scouting comfort level)",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "foley-creek",
    "riverId": "foley-creek",
    "name": "Foley Creek",
    "difficultyClass": "Class III(+) with potential IV moves with wood.",
    "description": "Overview: An alternative start to the Chilliwack Canyon",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/foley-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:59.225582Z",
    "updatedAt": "2025-11-18T19:09:59.225582Z",
    "season": "Fall-Spring\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"A wood-filled ditch barely wide enough for a creekboat sideways.\" That was the beta I had been given before but upon actually running this creek there was potential for much more from this little tributary of the Chilliwack.  This creek is basically an alternative put-on for the Chilliwack Canyon which gives you 3.5km extra river running.  It is mostly Class III with some spots that require some sharp maneuvers and below the Bench Road Bridge it is slightly harder and probably with high water it would be Class IV. Be aware that when this creek is in, the Chilliwack Canyon is probably going to be high enough to be continuous Class IV whitewater.  Luckily doing this run after a large storm most of the river was clear of wood, but you can inspect most of the run as you drive up.   There is only one larger rapid which isn't visible from the road but you can scout it easily.Don't expect wonders from this creek, you need quite high flows in the Chilliwack to even give you enough water to consider this 'in'.   I would have liked another 6inches or so water in the run to clean it up and make some of the bigger stuff nicer! The Chilliwack was running at 1.5m after about 30mm of rain overnight that also left a very visible snow-line, but it also had stopped raining for a few hours. Typically it'll be in when the Chilliwack has climbed quickly due to rain, but can also be in on snowmelt alone.  To get there drive to the Chiliwack Canyon take-out at Slesse Creek, that is the normal take-out of this run including the Class IV run.  Continue to the canyon put-on, cross over the Chilliwack, turn left down Bench Forest Service Road.  Drive until you go passed the main Chilliwack and see a smaller creek on your left.  Take a look as you drive up and stop at the bridge and have a look at the gauge rock.  If water is just going over this rock then it's on the good side of low, but has been paddled/rock-bashed lower. Make your own assessment, if you like the look of this section then you'll probably enjoy the rest of the run too.  If you don't like the look of it, turn around and go to the regular Chilliwack Canyon put-on instead.\n\n\n      The gauge rock, the middle of the big rocks.",
    "permits": "Can see most of run from the road.",
    "flowUnit": "cms",
    "estimatedTime": "30-45mins",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "harris-creek-canyon",
    "riverId": "harris-creek",
    "name": "Canyon",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A short run in a small canyon on the southern end of Vancouver Island.  Nice class IV-V boating.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/harris-creek-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:21.508018Z",
    "updatedAt": "2025-11-18T19:10:21.508018Z",
    "season": "Rain fed, fall through spring.",
    "permits": "Moderate.",
    "minRecommendedFlow": 4.5,
    "maxRecommendedFlow": 5.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours your first time.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "ryan-river-lower",
    "riverId": "ryan-river",
    "name": "Lower",
    "difficultyClass": "Continuous class IV-V. Class V at high flows.",
    "description": "Overview: Continuous boofalicious boulder gardens.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ryan-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:40.088758Z",
    "updatedAt": "2025-11-18T19:11:40.088758Z",
    "season": "Any time it's hot.",
    "permits": "Easy",
    "flowUnit": "cms",
    "estimatedTime": "1-3 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "clearwater-river-upper-upper",
    "riverId": "clearwater-river",
    "name": "Upper Upper",
    "difficultyClass": "Class IV- with optional V",
    "description": "Overview: Big Volume Wave train and Big Waterfalls on the same river!?",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clearwater-river-upper-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:28.842042Z",
    "updatedAt": "2025-11-18T19:09:28.842042Z",
    "season": "Later Summer",
    "permits": "Easy",
    "flowUnit": "cms",
    "stationId": "08LA001",
    "estimatedTime": "3 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "chilliwack-river-slesse-to-tamihi",
    "riverId": "chilliwack-river",
    "name": "Slesse to Tamihi",
    "difficultyClass": "Class III, one IV- @ Tamihi",
    "description": "Overview: Gravel bars, pool drop, some floating",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilliwack-river-slesse-to-tamihi",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:21.071998Z",
    "updatedAt": "2025-11-18T19:09:21.071998Z",
    "season": "Year round, may be too low in winter and late summer if it hasn't rained for a while",
    "permits": "Easy to scout",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "east-boulder-creek",
    "riverId": "east-boulder-creek",
    "name": "East Boulder Creek",
    "difficultyClass": "Class IV+ to V, level dependent.",
    "description": "Overview: A fantastic steep creek.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/east-boulder-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:49.743159Z",
    "updatedAt": "2025-11-18T19:09:49.743159Z",
    "season": "Late May through July and after fall rain.",
    "permits": "Everything can be scouted and portaged with difficulty.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 hr.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "spillimacheen",
    "riverId": "spillimacheen",
    "name": "Spillimacheen",
    "difficultyClass": "Class V",
    "description": "Overview: Short and sweet, Spilli has 5 major rapids with quality boogie water in between.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/spillimacheen",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:08.411444Z",
    "updatedAt": "2025-11-18T19:12:08.411444Z",
    "season": "Spring and fall - low water season",
    "permits": "Everything is scoutable and nearly everything is portageable.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "20 minutes to 3 hours, depending on time spent scouting and/or lapping rapids",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "bedwell-river",
    "riverId": "bedwell-river",
    "name": "Bedwell River",
    "difficultyClass": "Class IV+ (P)",
    "description": "Overview: A hike in multiday through the heart of Vancouver Island\n\nFlows: Look for the Gold (GOLD RIVER BELOW UCONA RIVER (08HC001)) to be around 100cms off snowmelt for a nice medium low level on the Bedwell, which can usually be found during spring snowmelt in May or June, depending on the snow year. Pacfish also maintains a staff gauge on the lower Bedwell River. Good levels may be between 0.6-1.0m, however this gauge is not regularly calibrated.\n\nShuttle: The shuttle is 5 hours each way, so you are going to want to find a shuttle driver or two. Start the hike at Bedwell Lakes trailhead in Strathcona Provincial Park, found past the south end of Buttle Lake, by branching off BC Highway 28 NW of Campbell River. Takeout is by chartered water taxi from the Bedwell River mouth to Tofino, at the terminus of BC Highway 4.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bedwell-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:15.458599Z",
    "updatedAt": "2025-11-18T19:08:15.458599Z",
    "putIn": "the hike at Bedwell Lakes trailhead in Strathcona Provincial Park, found past the south end of Buttle Lake, by branching off BC Highway 28 NW of Campbell River",
    "takeOut": "of Buttle Lake, by branching off BC Highway 28 NW of Campbell River",
    "season": "Spring snowmelt May-June",
    "permits": "Scouting is reasonable with some effort. Approximately 4 portages.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 very long day to hike in, 2 more days to paddle out",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "cheakamus-river-upper",
    "riverId": "cheakamus-river",
    "name": "Upper",
    "difficultyClass": "Class IV at 2.5, continuous.  Gets harder as levels rise.",
    "description": "Overview: Classic. Continuous river running at its finest.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:06.609098Z",
    "updatedAt": "2025-11-18T19:09:06.609098Z",
    "season": "Long season - spring, summer and fall.",
    "permits": "Easy to moderate - good boat scouting skills will make things go much faster.",
    "flowUnit": "cms",
    "stationId": "08GA072",
    "estimatedTime": "1.5 hours if you really take your time.  A casual 20 minutes when it's familiar.",
    "difficultyMin": 2,
    "difficultyMax": 5
  },
  {
    "id": "cayoosh-creek",
    "riverId": "cayoosh-creek",
    "name": "Cayoosh Creek",
    "difficultyClass": "Class IV+ at medium levels.",
    "description": "Overview: Nice river running through a deep, arid canyon.  Classic scenery and good whitewater.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cayoosh-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:55.624643Z",
    "updatedAt": "2025-11-18T19:08:55.624643Z",
    "season": "Later half of the SW BC season - July-August.  Spring is possible.",
    "permits": "Easy to difficult.",
    "flowUnit": "cms",
    "estimatedTime": "2-4 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "elaho-squamish",
    "riverId": "elaho-squamish",
    "name": "Elaho-Squamish",
    "difficultyClass": "Class III (IV-)",
    "description": "Overview: Cold water and big waves\n\nFlows: : Low: Elaho 60 cms, Squamish 130 cms. Medium: Elaho 150 cms, Squamish 300 cms. High: Elaho 300 cms, Squamish 600 cms.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/elaho-squamish",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:54.425945Z",
    "updatedAt": "2025-11-18T19:09:54.425945Z",
    "season": "Summer and fall",
    "flowUnit": "cms",
    "estimatedTime": "2-3 h",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "douglas-creek",
    "riverId": "douglas-creek",
    "name": "Douglas Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A short exciting run, with more to explore upstream.  A series of scenic waterfalls above from the small hydro dam infrastructure.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/douglas-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:43.144766Z",
    "updatedAt": "2025-11-18T19:09:43.144766Z",
    "season": "Spring/Summer",
    "permits": "Steep canyon, easy scouting",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "bridge-river",
    "riverId": "bridge-river",
    "name": "Bridge River",
    "difficultyClass": "Class III+-IV",
    "description": "Overview: Pool drop with big boulders + flat long scenic canyons",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/bridge-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:39.761868Z",
    "updatedAt": "2025-11-18T19:08:39.761868Z",
    "season": "July-August",
    "permits": "Some tricky scouting in spots, portaging very tricky on one or two rapids.",
    "flowUnit": "cms",
    "estimatedTime": "3.5 - 5 hours (add 1.5-2 hours if doing the full 40km)",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "cummins-river",
    "riverId": "cummins-river",
    "name": "Cummins River",
    "difficultyClass": "Class II-III (with portages)",
    "description": "Overview: Remote, multi-day packraft trip through wild old growth rainforest",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cummins-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:40.060111Z",
    "updatedAt": "2025-11-18T19:09:40.060111Z",
    "season": "Probably best in late summer / early fall",
    "permits": "Scouting and portaging can be difficult due to the thick bush",
    "flowUnit": "cms",
    "estimatedTime": "3-5 days",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "nass-river",
    "riverId": "nass-river",
    "name": "Nass River",
    "difficultyClass": "Class III-V",
    "description": "Overview: Everything from a 5-6 day wilderness trip to a big water play run.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/nass-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:20.838852Z",
    "updatedAt": "2025-11-18T19:11:20.838852Z",
    "permits": "All rapids can be scouted/portaged, except for Moose Carcass Canyon where it is hard to stop.",
    "hazards": [
      "Portage required"
    ],
    "maxRecommendedFlow": 1800.0,
    "flowUnit": "cms",
    "estimatedTime": "1-9 days, depending on the combination of sections.",
    "coordinates": {
      "latitude": 37.0,
      "longitude": 386.0
    },
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "gordon-river-flood-run",
    "riverId": "gordon-river",
    "name": "Flood Run",
    "difficultyClass": "Class III-IV (V).",
    "description": "Overview: A high water alternative to paddle when everything on the southern Island is flooding.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gordon-river-flood-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:08.693357Z",
    "updatedAt": "2025-11-18T19:10:08.693357Z",
    "season": "Fall/winter after heavy rainfall.",
    "permits": "Easy to moderate - there are no canyons, which let it remain runnable at super high water.",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "blaeberry-river-split-creek-to-thompson-falls",
    "riverId": "blaeberry-river",
    "name": "Split Creek to Thompson Falls",
    "difficultyClass": "Class III+ to IV",
    "description": "Overview: A seldom run, but decent quality intermediate run.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/blaeberry-river-split-creek-to-thompson-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:29.974412Z",
    "updatedAt": "2025-11-18T19:08:29.974412Z",
    "season": "Late May to late August, best above 30cms",
    "permits": "Mostly boat scouting/read and run. One of the bigger rapids can sneak up on you and is best scouted from river left.",
    "minRecommendedFlow": 30.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours on the water",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "cariboo-river-upper-run",
    "riverId": "cariboo-river",
    "name": "Upper Run",
    "difficultyClass": "Class III+ to IV- (IV in high water)",
    "description": "Overview: Big waves, big holes, continuous, mellower towards the end, Large Volume.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cariboo-river-upper-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:52.340062Z",
    "updatedAt": "2025-11-18T19:08:52.340062Z",
    "season": "Summer and Fall",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "coquitlam",
    "riverId": "coquitlam",
    "name": "Coquitlam",
    "difficultyClass": "Class III (IV-)",
    "description": "Overview: 'Novelty' run. A few boulder gardens, gravel bars and flat water. Rarely paddled because its usually too low. Watch for wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/coquitlam",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:36.803841Z",
    "updatedAt": "2025-11-18T19:09:36.803841Z",
    "season": "After a lot of rain",
    "permits": "Check the two boulder garden rapids near the put-in for wood and decide if you want to skip them",
    "hazards": [
      "Wood hazards"
    ],
    "minRecommendedFlow": 50.0,
    "maxRecommendedFlow": 70.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "blaeberry-river-thompson-falls-section",
    "riverId": "blaeberry-river",
    "name": "Thompson Falls Section",
    "difficultyClass": "Class IV+ to V",
    "description": "Overview: 2 short canyons. The first is a gorgeous class 2 slot canyon, the second is a short but intense class 5 canyon followed by a bit of class 3 run out.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/blaeberry-river-thompson-falls-section",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:31.579900Z",
    "updatedAt": "2025-11-18T19:08:31.579900Z",
    "season": "September",
    "permits": "Fully scout both canyons before dropping in. You can get out to scout or hike out between the 2.",
    "flowUnit": "cms",
    "estimatedTime": "Half a day. It would only take ~30 minutes of paddling if you knew the run and that it was clear of wood, however, there is lots of wood movement, so expect to take half a day.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "jordan-river",
    "riverId": "jordan-river",
    "name": "Jordan River",
    "difficultyClass": "Class IV+",
    "description": "Overview: The crown jewel of Revelstoke. « BC Class 4 » at it’s best.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/jordan-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:32.909889Z",
    "updatedAt": "2025-11-18T19:10:32.909889Z",
    "season": "July-August. Spring is possible",
    "permits": "Easy portages and scout on all rapids. A hiking trail runs all the way down river left from #3 onward.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "cheakamus-river-dam-run",
    "riverId": "cheakamus-river",
    "name": "Dam Run",
    "difficultyClass": "Class III",
    "description": "Overview: A fun, roadside class III with a short portage around a class V rapid. Runnable year round.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-dam-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:05.058686Z",
    "updatedAt": "2025-11-18T19:09:05.058686Z",
    "season": "Spring for highest flows. All year depending on your low water tolerance.",
    "permits": "Easy",
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "seymour-river-lower-run",
    "riverId": "seymour-river",
    "name": "Lower run",
    "difficultyClass": "Class II (III- at high levels)",
    "description": "Overview: Easy boulder gardens and gravel bars. Many boulder gardens, gravel bed, low volume; can be a challenge for beginners.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/seymour-river-lower-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:46.640371Z",
    "updatedAt": "2025-11-18T19:11:46.640371Z",
    "season": "Spring run-off and rain",
    "permits": "Read and run...",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "squamish-river-upper",
    "riverId": "squamish-river",
    "name": "Upper",
    "difficultyClass": "Class III-IV boating through some significant canyons.",
    "description": "Overview: Amazing canyons - unless you're brave, it's an early or late season scenery trip.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/squamish-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:10.075291Z",
    "updatedAt": "2025-11-18T19:12:10.075291Z",
    "season": "Very early or late season at low water.  Anything but low flows haven't been tested.",
    "permits": "Moderate. Impossible once in the canyons.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "pamela-creek",
    "riverId": "pamela-creek",
    "name": "Pamela Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: One of the better creeks in Gold River - excellent bedrock ledges and waterfalls, with some classic Island mank.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/pamela-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:25.636905Z",
    "updatedAt": "2025-11-18T19:11:25.636905Z",
    "season": "Rain fed all year, snow melt in the spring.",
    "permits": "Moderate.",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "st-leon-creek",
    "riverId": "st-leon-creek",
    "name": "St. Leon Creek",
    "difficultyClass": "Class V",
    "description": "Overview: A steep, small creek with hectic boogie interspersed with some big, clean bedrock drops.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/st-leon-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:20.709931Z",
    "updatedAt": "2025-11-18T19:12:20.709931Z",
    "season": "May-July in normal years.",
    "permits": "Moderate.  The big drops are walkable.",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "kicking-horse-palliser-to-kicking-horse-rest-area",
    "riverId": "kicking-horse",
    "name": "Palliser to Kicking Horse Rest Area",
    "difficultyClass": "Class III+/IV",
    "description": "Overview: 12 km of high quality river running",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kicking-horse-palliser-to-kicking-horse-rest-area",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:36.042668Z",
    "updatedAt": "2025-11-18T19:10:36.042668Z",
    "season": "April to November",
    "permits": "All rapids are boat-scoutable except \"portage/shotgun\" which has a sign to alert paddlers of where to scout from.",
    "hazards": [
      "Portage required"
    ],
    "maxRecommendedFlow": 150.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours on the water (15 min. at flood stage)",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "gordon-river-middle-gordon",
    "riverId": "gordon-river",
    "name": "Middle Gordon",
    "difficultyClass": "Class IV-V",
    "description": "Overview: Good pool-drop whitewater with big ledges and clean rapids.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/gordon-river-middle-gordon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:10.291091Z",
    "updatedAt": "2025-11-18T19:10:10.291091Z",
    "season": "Rain fed in the fall and winter.",
    "permits": "Usually easy - one of the longer rapids is hard to walk.",
    "minRecommendedFlow": 2.0,
    "maxRecommendedFlow": 6.0,
    "flowUnit": "cms",
    "stationId": "08HA070",
    "estimatedTime": "2-3 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "kleanza-creek",
    "riverId": "kleanza-creek",
    "name": "Kleanza Creek",
    "difficultyClass": "Class IV-V",
    "description": "Overview: A fantastic North Coast creek run.  High caliber whitewater with a deep and beautiful bedrock canyon.  Wood is a common problem.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kleanza-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:45.712147Z",
    "updatedAt": "2025-11-18T19:10:45.712147Z",
    "season": "May – June with snowmelt.  After a rain event.",
    "permits": "All rapids can be scouted and portaged.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 hours",
    "coordinates": {
      "latitude": 16.0,
      "longitude": 15.7
    },
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "big-mouth-creek",
    "riverId": "big-mouth-creek",
    "name": "Big Mouth Creek",
    "difficultyClass": "Class III-IV",
    "description": "Overview: A beautiful wilderness adventure, cruising down continuous rapids, surrounded by many unique rock features and old growth forests.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/big-mouth-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:22.125470Z",
    "updatedAt": "2025-11-18T19:08:22.125470Z",
    "season": "Spring and early summer",
    "permits": "Everything is boat scoutable",
    "flowUnit": "cms",
    "estimatedTime": "2 - 4 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "silverhope-creek",
    "riverId": "silverhope-creek",
    "name": "Silverhope Creek",
    "difficultyClass": "Class IV-IV+ to V, depending on the put in and take out used.",
    "description": "Overview: A good quality boulder run with tons of fun boogie.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/silverhope-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:49.673766Z",
    "updatedAt": "2025-11-18T19:11:49.673766Z",
    "season": "May-July or after rain.",
    "permits": "Easy to difficult.",
    "flowUnit": "cms",
    "estimatedTime": "1-4 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "seymour-river-canyon",
    "riverId": "seymour-river-canyon",
    "name": "Seymour River Canyon",
    "difficultyClass": "Highly level dependent - ranges from fun class IV to raging class V.",
    "description": "Overview: Classic kayaking in a deep box canyon.  You would never know it's in the heart of North Van.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/seymour-river-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:45.173637Z",
    "updatedAt": "2025-11-18T19:11:45.173637Z",
    "season": "Rain-fed all year, snowmelt in the spring and summer.",
    "permits": "Moderate scouting, difficult to impossible portaging.",
    "flowUnit": "cms",
    "estimatedTime": "1.5 hours including the hike for a first run.",
    "coordinates": {
      "latitude": 7.0,
      "longitude": 2014.0
    },
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "grand-canyon-of-the-stikine",
    "riverId": "grand-canyon-of-the-stikine",
    "name": "Grand Canyon of the Stikine",
    "difficultyClass": "Class V",
    "description": "Overview: The most famous class 5 multiday in North America. Big volume paddling in a spectacular, committing canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/grand-canyon-of-the-stikine",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:13.482663Z",
    "updatedAt": "2025-11-18T19:10:13.482663Z",
    "season": "August to September.  Snow pack and rain dependant.",
    "permits": "Scouting OK.  There are several large must run rapids.",
    "flowUnit": "cms",
    "estimatedTime": "Traditionally 3 days, can be done in 1 (or why not 2 laps in one day?).",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "stein-river-multiday-trip",
    "riverId": "stein-river",
    "name": "Multiday Trip",
    "difficultyClass": "Class IV-IV+, V at high water",
    "description": "Overview: A nice multiday trip on the arid side of the Coast Mountains.  Expect a lot of portages caused by wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/stein-river-multiday-trip",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:17.565804Z",
    "updatedAt": "2025-11-18T19:12:17.565804Z",
    "season": "July-August.",
    "permits": "Easy to difficult - the full spectrum.",
    "flowUnit": "cms",
    "estimatedTime": "2-4 days.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "alsek-river",
    "riverId": "alsek-river",
    "name": "Alsek River",
    "difficultyClass": "Class III-IV (V through Turnback Canyon)",
    "description": "Overview: One of the most spectacular northern wilderness trips in the world.  Challenging logistics, epic glaciers.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/alsek-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:00.343531Z",
    "updatedAt": "2025-11-18T19:08:00.343531Z",
    "season": "September or October if you want to attempt the canyon.  You need cold and dry weather. If you commit to                       portaging Turnback, go in July-September.",
    "permits": "Easy, except if you can't run Turnback Canyon then you face one of the most grueling portages out there.                                  It's a 6 km, day long hike over the terminal moraine of the Tweedsmuir Glacier.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "8-10 days (depends on how much hiking and exploring you want to do).",
    "coordinates": {
      "latitude": 97.0,
      "longitude": 0.0
    },
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "hurley-river-canyon",
    "riverId": "hurley-river",
    "name": "Canyon",
    "difficultyClass": "Class V",
    "description": "Overview: An impressive canyon with good class V whitewater.  A different feel from the typical Coast Mountain rivers.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/hurley-river-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:28.146441Z",
    "updatedAt": "2025-11-18T19:10:28.146441Z",
    "season": "A mid to late season run - July/August.",
    "permits": "Easy to moderate - despite the size of the canyon, everything can be scouted and/or portaged.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "stationId": "08ME027",
    "estimatedTime": "3-5 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "chilcotin-river-chilko-chilcotin-fraser",
    "riverId": "chilcotin-river-chilko-chilcotin-fraser",
    "name": "Chilcotin River  (Chilko-Chilcotin-Fraser)",
    "difficultyClass": "Class II-IV",
    "description": "Overview: Classic multiday raft trip across the Chilcotin Plateau\n\nFlows: The Chilcotin has one of the most predictable river flows in BC since its sources are the enormous glacier-fed Chilko and Taseko Lakes.\n\nShuttle: It's a big one: 5 hours each way for the Chilko-Chilcotin-Fraser shuttle, 3 hours each way for the Taseko-Chilko-Chilcotin-Fraser shuttle. Mostly on dirt roads.  Get a GPS and backcountry map that shows forest roads. Any car should make it, but high clearance is recommended, and if the roads are wet AWD/4WD will be nice to have. Fuel up beforehand in Clinton or Williams Lake, and also check the location and hours of gas stations on the shuttle route (e.g. Tl'etinqox, Redstone). Williams Lake is a small city and the best place to get groceries and supplies. You can call around the outdoor stores in town for a possible shuttle service, but there is no dedicated shuttle company. To get to the takeout from the south, turn left (west) off Highway 97 just north of Clinton onto Meadow Lake Road, and follow this for at least an hour down to the Gang Ranch suspension bridge over the Fraser River. Shortly after the bridge, turn left as the takeout is located 1km downstream (south) in Churn Creek Protected Area, down a small 4x4 road to a steep sandy beach on river right of the Fraser River just upstream of the Churn-Fraser confluence. To get to the Chilko River put in at Henry's Crossing, there are a few options depending on how much you like driving on dirt roads. Probably the fastest is west through the private lands of Gang Ranch to Big Creek, and cross the Chilcotin River at Hanceville arriving at Highway 20 at Lee's Corner. Another option is again through Gang Ranch, but head to Highway 20 by crossing the Chilcotin River at Farwell Canyon arriving at Highway 20 at Riske Creek. If you do this, stop at the Farwell Canyon bridge to scout Farwell Rapids. If it has been raining, the ranch roads can be very slippery, so avoid Gang Ranch, cross back to river left of the Fraser and take the Dog Creek Road north to Highway 20.  Whichever way you get to Highway 20, follow it west to Tatla Lake. Turn left (southeast) and follow Tatlayoko Road and Henry's Crossing Road to a bridge over the Chilko River at Henry's Crossing, a common put in. Unless it's closed for bears, you can also put in 15km upstream of Henry's Crossing on Chilko Lake at Gwe Da Ts’ih campground in Ts'ilɂos Park. A typical Chiko-Chilcotin-Fraser shuttle route: through Gang Ranch, across Farwell Canyon Bridge, west on Highway 20, southeast at Tatla Lake to Henry's Crossing. The route to the Taseko River put in at Davidson Bridge Recreation Site also starts west through Gang Ranch, but you stay on the south side of the Chilcotin River, all on dirt roads. There is nowhere to get gas or supplies. Do not try to short cut from Big Creek to Davidson Bridge, you have to drop down almost to the Chilcotin River at Hanceville before turning south again on Taseko Lake Road towards Nemiah Valley. You can also put in 30km upstream of Davidson Bridge at Taseko Lake with some exploratory 4x4 driving. A typical Taseko-Chilko-Chilcotin-Fraser shuttle route.\n\nOn the Water: The total trip length from Henry's Crossing on the Chilko River to Churn Creek on the Fraser River is ~215km (Chilko-Chilcotin-Fraser). The total trip length from Davidson Bridge on the Taseko River to Churn Creek on the Fraser River is ~230km (Taseko-Chilko-Chilcotin-Fraser). For either option, late summer raft trips generally take 5-7 days on the river, plus shuttle. A typical high water kayak trip is 3 days on the water.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilcotin-river-chilko-chilcotin-fraser",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:13.506458Z",
    "updatedAt": "2025-11-18T19:09:13.506458Z",
    "putIn": "at Henry's Crossing, there are a few options depending on how much you like driving on dirt roads",
    "takeOut": "from the south, turn left (west) off Highway 97 just north of Clinton onto Meadow Lake Road, and follow this for at least an hour down to the Gang Ranch suspension bridge over the Fraser River",
    "season": "Most popular once water levels drop in late August and September. Runnable at high water all summer.",
    "permits": "Not always practical - come prepared to read and run the biggest rapids",
    "minRecommendedFlow": 50.0,
    "maxRecommendedFlow": 70.0,
    "flowUnit": "cms",
    "estimatedTime": "3-7 days for the Chilko-Chilcotin-Fraser multiday",
    "coordinates": {
      "latitude": 2.0,
      "longitude": 500.0
    },
    "difficultyMin": 2,
    "difficultyMax": 4
  },
  {
    "id": "babine-river",
    "riverId": "babine-river",
    "name": "Babine River",
    "difficultyClass": "Class III+-IV",
    "description": "Overview: A classic, class 3/4 wilderness multiday.  Big water on the Skeena.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/babine-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:12.002496Z",
    "updatedAt": "2025-11-18T19:08:12.002496Z",
    "season": "May – October.  Early summer for the most fun",
    "permits": "Most rapids can be scouted and portaged.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "stationId": "08EC013",
    "estimatedTime": "3-4 days (150km)",
    "coordinates": {
      "latitude": 13.0,
      "longitude": 5.0
    },
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "goldstream-falls",
    "riverId": "goldstream-falls",
    "name": "Goldstream Falls",
    "difficultyClass": "Class V",
    "description": "Overview: Four sweet park and huck water",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/goldstream-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:07.077385Z",
    "updatedAt": "2025-11-18T19:10:07.077385Z",
    "season": "Late fall",
    "permits": "Scouting and portaging are easy at river level",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "big-silver-creek-middle",
    "riverId": "big-silver-creek",
    "name": "Middle",
    "difficultyClass": "Class V",
    "description": "Overview: Very committing granite gorge with big rapids, marginal waterfalls and hard portages.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/big-silver-creek-middle",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:23.761725Z",
    "updatedAt": "2025-11-18T19:08:23.761725Z",
    "season": "When water spills over the dam at peak snowmelt, or releases in July/August.",
    "permits": "Difficult.",
    "flowUnit": "cms",
    "estimatedTime": "Full day trip.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "ashlu-creek-mine-run",
    "riverId": "ashlu-creek",
    "name": "Mine Run",
    "difficultyClass": "Class IV-V at medium levels.",
    "description": "Overview: An under-rated classic - bedrock rapids, many big holes.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashlu-creek-mine-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:05.665547Z",
    "updatedAt": "2025-11-18T19:08:05.665547Z",
    "season": "July through early September.",
    "permits": "All scoutable.  Tough river level portaging possible in most spots.  One or two must-run rapids.",
    "minRecommendedFlow": 5.0,
    "maxRecommendedFlow": 10.0,
    "flowUnit": "cms",
    "stationId": "08GA071",
    "estimatedTime": "2-4 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "benson-river-lower",
    "riverId": "benson-river",
    "name": "Lower",
    "difficultyClass": "Class V",
    "description": "Overview: A sketchy caving trip in your kayak\n\nFlows: The Benson River has several small lakes which should regulate flow somewhat throughout the winter and spring. However, the Lower Benson should only be attempted at low to medium water in between winter rain events. The river is likely runnable from October through June in the right conditions.  Recommended flows are between 10-20cms, but this will be difficult to estimate with no active gauge and most access points starting on lakes. At very low water portions of the river are reported to flow entirely underground. It's possible to explore around the Devil's Bath Recreation Site to get a feel for the flow through the first canyon. BENSON RIVER NEAR PORT ALICE (08HE003). Historical flow data from a limited record from 1925-1931. Recommended flows are ~10-20cms.\n\nShuttle: To get to the river, take the north island highway past Port McNeill, turn west on Highway 30 (The Frigon Road) towards Port Alice. After passing Marble River Provincial Park, but before reaching Port Alice, turn left onto the Southeast Main and follow this ~6km to the Link River Campground, a possible takeout. Follow the Southeast Main and the Alice Lake Main up the river left side of the Benson River to the Devils Bath Recreation Site, to scout the first canyon and check the level. From here, either continue upstream to Kathleen Lake Recreation Site to put in on river left, or circle back to the river right to put in at the other end of Kathleen Lake near the Eternal Fountain.\n\nOn the Water: From either end of Kathleen Lake, paddle 2km to the lake outlet between limestone bluffs. Shortly below the lake, a class III rapid pushes into an undercut wall river right which most likely has a cave tunnel. Around the bend under a set of powerlines, flow appears to emerge from this tunnel at a questionable ledge drop with an old growth log. Even without the log, this area appears constricted and suspiciously little water is flowing on surface, so portaging on the right is recommended. Approximately 100m downstream of the powerlines on river left is the mapped sink for the Devil's Bath cave system, where water flows into the subsurface cave system to join the cenote. Needless to say, stay away from every wall on this run. Just after this headwall, it is possible to eddy out on river left and explore a dry cave. There is a pinch rapid in this section that is the crux of the first canyon (class III+ at medium flows), and if there is a problem with wood or something else it should be possible to escape with difficulty up the caver trails to the Devils Bath parking lot. Below the pinch, it is possible to paddle up into the outlets of the cave system, a highlight of the run. After a couple more class III rapids, the canyon opens up, and if you can explore for a takeout in this area to the nearby road, this first canyon could be paddled very carefully at the class III+ level. Below the first canyon, the river eases off for several km, but just as you expect to reach Alice Lake a horizon line appears. This is the second canyon, a committing class V zone with a lot of unstable rockfall debris. The first significant ledge, Boof or Consequences, has a clean boof in the centre surrounded by undercuts. Portaging or hiking out appears difficult at this point, and once you boof the ledge you are committed to running or portaging the crux, the Green Monster. Three major ledges of varying runnability funnel into an ugly limestone headwall at the bottom. The portage is on river right over unstable rockfall debris, putting in within the sieve pile at the bottom. But wait, there is still a hairy ferry to get out of the eddy, through the outwash of the rapid and just escaping the wall. This section has a lot of objective risk, probably comparable to the Cayoosh Creek landslide rapid, or maybe higher. Once past the crux, there is one more fun rapid and then the river eases off down to Alice Lake and your campsite.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/benson-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:17.318494Z",
    "updatedAt": "2025-11-18T19:08:17.318494Z",
    "putIn": "on river left, or circle back to the river right to put in at the other end of Kathleen Lake near the Eternal Fountain",
    "takeOut": "of Kathleen Lake near the Eternal Fountain",
    "season": "October to April in between rain storms. Spring snowmelt possible",
    "permits": "Difficult",
    "minRecommendedFlow": 10.0,
    "maxRecommendedFlow": 20.0,
    "flowUnit": "cms",
    "estimatedTime": "4 hours",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "birkenhead-river-upper",
    "riverId": "birkenhead-river",
    "name": "Upper",
    "difficultyClass": "Class IV-V at medium, V at medium-high and up.",
    "description": "Overview: Endless, top notch boulder drops that only get better as the run progresses.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/birkenhead-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:28.514163Z",
    "updatedAt": "2025-11-18T19:08:28.514163Z",
    "season": "July-August snow melt.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours for a first trip.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "chemainus-river-copper-canyon",
    "riverId": "chemainus-river",
    "name": "Copper Canyon",
    "difficultyClass": "Class III-IV+ at medium levels.",
    "description": "Overview: Good moderate difficulty whitewater with some beautiful canyons.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chemainus-river-copper-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:11.504900Z",
    "updatedAt": "2025-11-18T19:09:11.504900Z",
    "season": "Winter rainy season.",
    "permits": "Varies.  Some difficult portage options in spots; the hardest rapids have desperate portage options.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "soo-river-railroad-canyon",
    "riverId": "soo-river",
    "name": "Railroad Canyon",
    "difficultyClass": "Class V",
    "description": "Overview: A short, stout addition to the classic section of the Soo.  Easy access canyon with big holes.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/soo-river-railroad-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:06.777191Z",
    "updatedAt": "2025-11-18T19:12:06.777191Z",
    "season": "Summer - preferred when the Soo is medium and lower.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "1 hour.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "tamihi-creek-upper",
    "riverId": "tamihi-creek",
    "name": "Upper",
    "difficultyClass": "Class IV+ / V",
    "description": "Overview: Steep boulder gardens, continuous, low volume",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tamihi-creek-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:23.806988Z",
    "updatedAt": "2025-11-18T19:12:23.806988Z",
    "season": "Snowmelt or Rain",
    "permits": "Essential for the take-out, to be determined for the rest of the run, the river is mostly road-side.",
    "flowUnit": "cms",
    "stationId": "08MH103",
    "estimatedTime": "TBC",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "upana-river",
    "riverId": "upana-river",
    "name": "Upana River",
    "difficultyClass": "Class IV+ to V",
    "description": "Overview: A short creek run in Gold River with a blind 20 footer",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/upana-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:44.582568Z",
    "updatedAt": "2025-11-18T19:12:44.582568Z",
    "season": "After rainfall October-March, snowmelt April-June",
    "permits": "The canyon section including the waterfall is not easily scoutable",
    "hazards": [
      "Waterfall"
    ],
    "maxRecommendedFlow": 100.0,
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "thompson-river-goldpan-to-frog",
    "riverId": "thompson-river-goldpan-to-frog",
    "name": "Thompson River – Goldpan to Frog",
    "difficultyClass": "Class III-",
    "description": "Overview: Lots of flat water with some powerful eddylines, whirlpools and a few waves, huge volume river.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/thompson-river-goldpan-to-frog",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:28.881627Z",
    "updatedAt": "2025-11-18T19:12:28.881627Z",
    "season": "Late summer and fall.",
    "flowUnit": "cms",
    "estimatedTime": "3 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "tutshi-river",
    "riverId": "tutshi-river",
    "name": "Tutshi River",
    "difficultyClass": "Class III-IV at low water, IV-V at high water",
    "description": "Overview: Fantastic big volume creeking.  The best and most accessible whitewater out of Whitehorse, Yukon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tutshi-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:41.370424Z",
    "updatedAt": "2025-11-18T19:12:41.370424Z",
    "season": "May to August, with the best flows in May/June.",
    "permits": "Easy.",
    "flowUnit": "cms",
    "estimatedTime": "2 hours to cover 4 km.",
    "difficultyMin": 3,
    "difficultyMax": 5
  },
  {
    "id": "clearwater-river-upper",
    "riverId": "clearwater-river",
    "name": "Upper",
    "difficultyClass": "Class IV",
    "description": "Overview: Sabretooth Rapid to The Kettle",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/clearwater-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:27.205267Z",
    "updatedAt": "2025-11-18T19:09:27.205267Z",
    "season": "Summer",
    "permits": "Roadside scouting, all portagable but you won't want to!",
    "flowUnit": "cms",
    "estimatedTime": "3 hours",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "marble-river",
    "riverId": "marble-river",
    "name": "Marble River",
    "difficultyClass": "Class II-III with optional V",
    "description": "Overview: A scenic full day paddle with optional class V drops\n\nFlows: The Marble River has several large lakes which should regulate flow throughout the winter and spring, perhaps similar to the Cowichan River system. However, the class V drops on the Marble are going to be more runnable at low to medium levels in dry periods between rain events. During high water winter rains the class V rapids may get unreasonably high. The sweet spot to run all of the class V drops at a reasonable level might be in the late spring (May, June). The river is possibly runnable into the summer if you want to explore ELF boating like on the Cowichan. Recommended flows are between 20-50cms, on the Environment Canada gauge Marble River at outlet of Alice Lake. MARBLE RIVER AT OUTLET OF ALICE LAKE (08HE001). Limited historical gauge data: from 1925-1930; 1931-1932; 1969-1970; 1971. Recommended flows are 20-50cms.\n\nShuttle: To get to the put in, take the north island highway past Port McNeill, turn west on Highway 30 (The Frigon Road) towards Port Alice and a bridge over the river at Marble River Provincial Park. The closest take out option is at the Varney log dump on Rupert Inlet, found by doubling back on the highway, turning left (north) onto the Port Hardy Main, and left again (west) onto the Varney Main. It's also possible to take out at Coal Harbour or the head of Rupert Inlet. Another option would be to paddle half the run to Bear Falls, then hike back to the put in on the river left trail.\n\nOn the Water: The river alternates between class II sections and portageable class V drops. All of the big rapids can be scouted at portaged on river left, sometimes by going up and into the open forest. At winter flows, class III skills are recommended to catch eddies in swift water above class V drops. At low flows in the late spring or summer, the river is reported to have a more pool drop character and class II skills may be adequate. The first rapid visible from the highway, Lake Outlet Falls (V), is a technical slide with a few big holes. Most people will put on below, in the campground. After a section of class II, the first canyon appears. A lead in rapid flows right into a couple drops in the IV-V range. After a short open section, Bear Falls (V) is a riverwide 4m ledge, which is not very clean since it was blasted for fisheries purposes. After more class II, the second canyon starts abruptly at Twin Falls (V). At winter flows, this is a boxed in set of violent ledge holes. Presumably these get more runnable with less water. The rest of the second canyon is beautiful flatwater in a deep canyon, with a couple class II-III rapids with avoidable undercuts. After a long intertidal zone through the estuary, it is another 5-10km paddle across the inlet to whichever takeout you selected. Quatsino Narrows is nearby and has tidal exchanges up to 8 knots. At high tide, it's possible to paddle flatwater upstream from the inlet into the scenic lower canyon.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/marble-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:06.370689Z",
    "updatedAt": "2025-11-18T19:11:06.370689Z",
    "putIn": "on the river left trail",
    "takeOut": "option is at the Varney log dump on Rupert Inlet, found by doubling back on the highway, turning left (north) onto the Port Hardy Main, and left again (west) onto the Varney Main",
    "season": "October through June, consistent flow from a large lake.",
    "permits": "The big drops can be scouted and portaged on river left.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 20.0,
    "maxRecommendedFlow": 50.0,
    "flowUnit": "cms",
    "estimatedTime": "3-6 hours.",
    "difficultyMin": 2,
    "difficultyMax": 5
  },
  {
    "id": "muelville-creek-falls",
    "riverId": "muelville-creek-falls",
    "name": "Muelville Creek falls",
    "difficultyClass": "Class V",
    "description": "Overview: Two park and hucks in a beautiful canyon",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/muelville-creek-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:15.944051Z",
    "updatedAt": "2025-11-18T19:11:15.944051Z",
    "season": "Early spring and summer",
    "permits": "Easy scouting and portaging on well maintained trails",
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "cheakamus-river-balls-to-the-wall",
    "riverId": "cheakamus-river",
    "name": "Balls To The Wall",
    "difficultyClass": "Class IV-IV+",
    "description": "Overview: Extension of the Upper Cheak - great class IV-IV+ river running, and a bonus waterfall.  Some wood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-balls-to-the-wall",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:58.771993Z",
    "updatedAt": "2025-11-18T19:08:58.771993Z",
    "season": "All season, very pushy at high flows.  Reasonable minimum is 2.1.",
    "permits": "Scouting is ok.  Difficult to portage in spots, if you're forced to.  Falls is easy to walk.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "stationId": "08GA072",
    "estimatedTime": "2-3 hours for a relaxed first trip.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "mcgregor-canyon",
    "riverId": "mcgregor-canyon",
    "name": "McGregor Canyon",
    "difficultyClass": "Class IV+-V",
    "description": "Overview: A really nice 5km (ish) canyon located northeast of Prince George. Great character to the whitewater.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/mcgregor-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:09.558703Z",
    "updatedAt": "2025-11-18T19:11:09.558703Z",
    "season": "Fall, or anytime the river is low.",
    "permits": "Most things can be scouted fairly easily at river level with a combination of boat scouting and hoping out in a few places. One portage around a logjam (in fall of 2020). The longest rapid would require more work to fully scout, however, most of it can be seen (at a distance) from the river right bank.",
    "hazards": [
      "Portage required",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "A full day, especially if you include the driving time.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "coquihalla-river",
    "riverId": "coquihalla-river",
    "name": "Coquihalla River",
    "difficultyClass": "Class III+",
    "description": "Overview: Continuous boulder gardens, pool-drop, gravel bed, short bedrock canyon, some floating sections, medium volume.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/coquihalla-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:35.372390Z",
    "updatedAt": "2025-11-18T19:09:35.372390Z",
    "season": "Spring snow-melt (May and early June)",
    "permits": "Easy to scout",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "lens-creek",
    "riverId": "lens-creek",
    "name": "Lens Creek",
    "difficultyClass": "Class IV-V at low to medium flows",
    "description": "Overview: A local favorite on southern Vancouver Island.  An adventurous day of rapids, shuttling and portaging.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/lens-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:50.493742Z",
    "updatedAt": "2025-11-18T19:10:50.493742Z",
    "season": "Fall through spring after rain.  Runs when most other things are low.",
    "permits": "Moderate to difficult.  Some must-run whitewater and a complex near-mandatory portage.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 2.5,
    "maxRecommendedFlow": 4.5,
    "flowUnit": "cms",
    "stationId": "08HA070",
    "estimatedTime": "4-6 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "chilliwack-river-pointa-vista-to-vedder-bridge",
    "riverId": "chilliwack-river",
    "name": "Pointa Vista to Vedder Bridge",
    "difficultyClass": "Class II",
    "description": "Overview: Braided gravel bed, pool drop, medium volume",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chilliwack-river-pointa-vista-to-vedder-bridge",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:18.058045Z",
    "updatedAt": "2025-11-18T19:09:18.058045Z",
    "season": "Year round. Could be too low in late summer, fall and winter if it doesn’t rain for a while.",
    "permits": "Should be easy but watch for wood",
    "hazards": [
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3 h",
    "difficultyMin": 2,
    "difficultyMax": 2
  },
  {
    "id": "boston-bar-creek",
    "riverId": "boston-bar-creek",
    "name": "Boston Bar Creek",
    "difficultyClass": "Class IV",
    "description": "Overview: A park and huck next to the Coquihalla Highway",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/boston-bar-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:36.274481Z",
    "updatedAt": "2025-11-18T19:08:36.274481Z",
    "season": "May-June",
    "permits": "Easy if you like bushwhacking",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours for full run. Or, a BC roadside park and huck.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "cheakamus-river-daisy-lake-canyon",
    "riverId": "cheakamus-river",
    "name": "Daisy Lake Canyon",
    "difficultyClass": "Class V at medium levels.",
    "description": "Overview: The hardest regularly run section of the Cheak - excellent boating in a good canyon with a few gnarly spots.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cheakamus-river-daisy-lake-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:03.562565Z",
    "updatedAt": "2025-11-18T19:09:03.562565Z",
    "season": "Early or late season.",
    "permits": "Moderate to difficult.",
    "flowUnit": "cms",
    "stationId": "08GA072",
    "estimatedTime": "3-4 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "tsable-river-prickly-canyon",
    "riverId": "tsable-river",
    "name": "Prickly Canyon",
    "difficultyClass": "Class V",
    "description": "Overview: Steep, continuous and committing with various slides and drops.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tsable-river-prickly-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:38.301224Z",
    "updatedAt": "2025-11-18T19:12:38.301224Z",
    "season": "Winter - In when most other things around there are too low",
    "permits": "Prickly",
    "minRecommendedFlow": 10.0,
    "maxRecommendedFlow": 12.0,
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours",
    "coordinates": {
      "latitude": 49.5251663691617,
      "longitude": -124.84815684737005
    },
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "lynn-creek",
    "riverId": "lynn-creek",
    "name": "Lynn Creek",
    "difficultyClass": "Class III at low levels, IV when the water is high.",
    "description": "Overview: A popular urban run with a picturesque canyon and fun rapids.  Optional waterfall at the start.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/lynn-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:59.876522Z",
    "updatedAt": "2025-11-18T19:10:59.876522Z",
    "season": "After heavy rain, usually in the fall/winter.",
    "permits": "Varied - some of the river is in a deep canyon.  Wood is often a problem.",
    "hazards": [
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1-2 hours.",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "kicking-horse-yoho-park-boundary-to-palliser",
    "riverId": "kicking-horse",
    "name": "Yoho Park Boundary to Palliser",
    "difficultyClass": "Class II+",
    "description": "Overview: Scenic river running with significant wood hazard",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kicking-horse-yoho-park-boundary-to-palliser",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:40.615699Z",
    "updatedAt": "2025-11-18T19:10:40.615699Z",
    "season": "Spring to Fall",
    "permits": "Everything is scoutable and portageable. Stopping could be difficult for inexperienced kayakers, especially at high water",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "1 hour",
    "difficultyMin": 2,
    "difficultyMax": 2
  },
  {
    "id": "big-silver-creek-upper",
    "riverId": "big-silver-creek",
    "name": "Upper",
    "difficultyClass": "Class IV-IV+ at medium levels",
    "description": "Overview: Boulder rapids in deep gorges, one clean waterfall.  Fantastic scenery.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/big-silver-creek-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:25.338860Z",
    "updatedAt": "2025-11-18T19:08:25.338860Z",
    "season": "Early/mid season run - May through July.  Will get too high at peak snowmelt and too low in mid/late summer.",
    "permits": "Easy to moderate.",
    "flowUnit": "cms",
    "stationId": "08MF065",
    "estimatedTime": "2-4 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "thompson-river",
    "riverId": "thompson-river",
    "name": "Thompson River",
    "difficultyClass": "Class III, big water.",
    "description": "Overview: Big water boating in a warm climate with some play opportunities.  Interesting scenery.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/thompson-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:27.362624Z",
    "updatedAt": "2025-11-18T19:12:27.362624Z",
    "season": "All year.  Best season is in August-October.",
    "permits": "Easy to moderate - far enough from the road that walking out would be difficult.",
    "flowUnit": "cms",
    "stationId": "08LF051",
    "estimatedTime": "2-5 hours.",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "tulameen-river",
    "riverId": "tulameen-river",
    "name": "Tulameen River",
    "difficultyClass": "Class II-III (IV for \"Tulameanie Drop\"",
    "description": "Overview: A chill run with an out of character class IV drop.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/tulameen-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:39.799130Z",
    "updatedAt": "2025-11-18T19:12:39.799130Z",
    "season": "Early Summer",
    "permits": "Scout / portage the main drop on the left",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 2,
    "difficultyMax": 4
  },
  {
    "id": "coal-river-lower",
    "riverId": "coal-river",
    "name": "Lower",
    "difficultyClass": "Class I-III (IV)",
    "description": "Overview: A floaty wilderness multiday with an nice whitewater canyon at the end.\n\nFlows: There is no gauge on the Coal River, but you can get a general idea of flows from nearby gauges (Liard, Hyland, Nahanni). Flows generally rise high off snowpack melt into May and June, before gradually dropping through the rest of the summer. An early July trip (LIARD RIVER AT LOWER CROSSING @ 4000cms) was a fun medium high flow for kayaking. The guidebook Paddling in Yukon also describes this as a great August or September trip, including for decked canoes (LIARD RIVER AT LOWER CROSSING median flow 1100-1700cms). The actual flow in the Lower Coal reach will only be an estimated ~5-10% of these values. Daily Discharge Graph for LIARD RIVER AT LOWER CROSSING (10BE001).",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/coal-river-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:33.897717Z",
    "updatedAt": "2025-11-18T19:09:33.897717Z",
    "season": "Summer (June-Sept).",
    "permits": "The two harder drops can be portaged with some effort. Portaging all the rapids would be impractical.",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 1100.0,
    "maxRecommendedFlow": 1700.0,
    "flowUnit": "cms",
    "estimatedTime": "2-5 days",
    "difficultyMin": 1,
    "difficultyMax": 4
  },
  {
    "id": "slesse-creek",
    "riverId": "slesse-creek",
    "name": "Slesse Creek",
    "difficultyClass": "Class III with a short IV- canyon",
    "description": "Overview: Low volume, gravel bed, many boulder gardens with a short narrow canyon section (“Keyhole Canyon”).",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/slesse-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:12:00.533162Z",
    "updatedAt": "2025-11-18T19:12:00.533162Z",
    "season": "Spring-Fall",
    "permits": "Scout Keyhole Canyon on the drive to the put in",
    "flowUnit": "cms",
    "estimatedTime": "2 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "chehalis-river-upper",
    "riverId": "chehalis-river",
    "name": "Upper",
    "difficultyClass": "Class IV with optional V",
    "description": "Overview: A full day adventure through a series of canyons",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/chehalis-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:09.927269Z",
    "updatedAt": "2025-11-18T19:09:09.927269Z",
    "season": "Rainfall October-March, snowmelt April-June",
    "permits": "Mostly scoutable and portageable with some work, except for the lead in to the crux rapid.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "4-6 hours including scouting",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "cariboo-river-lower-run",
    "riverId": "cariboo-river",
    "name": "Lower Run",
    "difficultyClass": "Class II to III (III+ at high water)",
    "description": "Overview: Big waves, some holes and boulders, a canyon, and flat water at the end. Large Volume",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cariboo-river-lower-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:50.900381Z",
    "updatedAt": "2025-11-18T19:08:50.900381Z",
    "season": "Summer and Fall",
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 2,
    "difficultyMax": 3
  },
  {
    "id": "cameron-river",
    "riverId": "cameron-river",
    "name": "Cameron River",
    "difficultyClass": "Class IV at medium levels",
    "description": "Overview: Excellent river-running with small canyons and bedrock rapids.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/cameron-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:47.819774Z",
    "updatedAt": "2025-11-18T19:08:47.819774Z",
    "season": "After rain.  Short snowmelt season in the spring.",
    "permits": "Moderate - a few rapids would be difficult to walk.",
    "flowUnit": "cms",
    "stationId": "08HB002",
    "estimatedTime": "1-3 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "ashlu-creek-bottom-mile",
    "riverId": "ashlu-creek",
    "name": "Bottom Mile",
    "difficultyClass": "Class V",
    "description": "Overview: The last hurrah of the Ashlu.  Steep boulder piles that equate to difficult but good kayaking.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/ashlu-creek-bottom-mile",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:08:02.444348Z",
    "updatedAt": "2025-11-18T19:08:02.444348Z",
    "season": "No definite window - whenever water spills over the dam.",
    "permits": "Easy to moderate, at river level.",
    "minRecommendedFlow": 2.0,
    "maxRecommendedFlow": 5.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "kitsumkalum-kalum-river",
    "riverId": "kitsumkalum-kalum-river",
    "name": "Kitsumkalum (Kalum) River",
    "difficultyClass": "Class III+ to IV.  Pushy at high water - a swim would be unpleasant.",
    "description": "Overview: Big water play run.  At high water, one of the best play runs in BC.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/kitsumkalum-kalum-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:42.472777Z",
    "updatedAt": "2025-11-18T19:10:42.472777Z",
    "season": "All year.  May-June for high water snowmelt and best Dog Dish levels.  Fall rain provides frequent high water.",
    "permits": "Both of the significant rapids can be scouted and portaged with difficulty.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "30 min - 2 hr.  Level dependent.  Are you stopping to surf?",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "skookumchuck-creek",
    "riverId": "skookumchuck-creek",
    "name": "Skookumchuck Creek",
    "difficultyClass": "Class III+-IV",
    "description": "Overview: 16 km of high quality whitewater. River running at medium-high water with more of a creeky feel at medium-low water.\n\nFlows: : There is a painted rock gauge at the takeout. 1 is low, 3 is high. It can certainly be run higher, but does turn very fast and continuous with few eddies and shoreline trees become a real hazard. Typically this river runs at good flows in early to mid summer, after the spring flood.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/skookumchuck-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:57.520575Z",
    "updatedAt": "2025-11-18T19:11:57.520575Z",
    "season": "Spring and Summer",
    "permits": "Scouting is not difficult, however it would take far too long to scout all of the rapids on the run from the bank.",
    "flowUnit": "cms",
    "estimatedTime": "2-5 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "rutherford-creek",
    "riverId": "rutherford-creek",
    "name": "Rutherford Creek",
    "difficultyClass": "Continuous class IV-V, class V at higher levels.",
    "description": "Overview: Continuous boulder rapids studded with some classic bedrock drops.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/rutherford-creek",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:38.498000Z",
    "updatedAt": "2025-11-18T19:11:38.498000Z",
    "season": "Whistler high water season - quite a bit of water needs to go over the dam to give good flows.",
    "permits": "Easy to moderate.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours.",
    "difficultyMin": 4,
    "difficultyMax": 5
  },
  {
    "id": "nahatlatch-river-canyon",
    "riverId": "nahatlatch-river",
    "name": "Canyon",
    "difficultyClass": "Class IV at medium levels.",
    "description": "Overview: A short but fun medium volume run on the dry side of the Coast Mountains.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/nahatlatch-river-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:19.090313Z",
    "updatedAt": "2025-11-18T19:11:19.090313Z",
    "season": "July-August in a normal year.  Earlier for high water runs.",
    "permits": "Easy scouting, moderate portaging.",
    "minRecommendedFlow": 40.0,
    "maxRecommendedFlow": 80.0,
    "flowUnit": "cms",
    "stationId": "08MF065",
    "estimatedTime": "1-2 hours.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "duti-river",
    "riverId": "duti-river",
    "name": "Duti River",
    "difficultyClass": "Class IV+, depending on the level",
    "description": "Overview: The Duti offers challenging whitewater in a spectacular remote wilderness setting.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/duti-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:09:46.422517Z",
    "updatedAt": "2025-11-18T19:09:46.422517Z",
    "season": "August / September. The first descent crew went in July at higher water. The first 2 days were full-on continuous class IV at this level and the lower canyons were very serious. Later in the year (August / Sept) the upper sections are a bit bonier but the main canyon becomes more manageable.",
    "permits": "Everything can be portaged with varying levels of difficulty.",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 days on the Duti and another 3-6 days on the Skeena depending on your choice of takeout.",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "little-qualicum-falls",
    "riverId": "little-qualicum-falls",
    "name": "Little Qualicum Falls",
    "difficultyClass": "Class V",
    "description": "Overview: An exciting double drop draped in mystical Vancouver Island rainforest.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/little-qualicum-falls",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:55.254509Z",
    "updatedAt": "2025-11-18T19:10:55.254509Z",
    "season": "Rain fed in the fall/winter, snowmelt in the spring.",
    "permits": "Easy - scout from the trail network.",
    "minRecommendedFlow": 10.0,
    "maxRecommendedFlow": 15.0,
    "flowUnit": "cms",
    "stationId": "08HB029",
    "estimatedTime": "Park and huck; scouting + 2 minutes of paddling.",
    "difficultyMin": 5,
    "difficultyMax": 5
  },
  {
    "id": "meager-creek-lower",
    "riverId": "meager-creek",
    "name": "Lower",
    "difficultyClass": "Class IV(+), very continuous",
    "description": "Overview: A glacial read and run blitz underneath one of Canada's most unstable volcanoes.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/meager-creek-lower",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:11.153805Z",
    "updatedAt": "2025-11-18T19:11:11.153805Z",
    "season": "Summer (June-Sept). Can probably scrape down at other times of year.",
    "permits": "The whole run can be scouted from the hike in.",
    "flowUnit": "cms",
    "estimatedTime": "2 hour hike in, 30 minute paddle out",
    "difficultyMin": 4,
    "difficultyMax": 4
  },
  {
    "id": "middle-memekay-river",
    "riverId": "middle-memekay-river",
    "name": "Middle Memekay River",
    "difficultyClass": "Class III+ with one IV",
    "description": "Overview: Nice long intermediate canyon run from a small creek down into a river.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/middle-memekay-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:12.746066Z",
    "updatedAt": "2025-11-18T19:11:12.746066Z",
    "season": "During and just after rainfall October-May.",
    "permits": "The only class IV rapid can be scouted and portaged. Some of the other canyons are mandatory and wood-prone.",
    "hazards": [
      "Portage required",
      "Unrunnable canyon",
      "Wood hazards"
    ],
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "similkameen-canyon",
    "riverId": "similkameen-canyon",
    "name": "Similkameen Canyon",
    "difficultyClass": "Class III+/IV-/IV",
    "description": "Overview: Beautiful Deep Canyon running through some unique scenery",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/similkameen-canyon",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:51.276980Z",
    "updatedAt": "2025-11-18T19:11:51.276980Z",
    "season": "Spring/summer",
    "permits": "Mostly easy",
    "flowUnit": "cms",
    "estimatedTime": "1.5 or 3-6 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "nahatlach-river-francis-lake-to-apocynum-campground",
    "riverId": "nahatlach-river-francis-lake-to-apocynum-campground",
    "name": "Nahatlach River – Francis Lake to Apocynum Campground",
    "difficultyClass": "Class III+(IV)",
    "description": "Overview: Medium volume, continuous boulder gardens, big holes, lots of fun.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/nahatlach-river-francis-lake-to-apocynum-campground",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:17.530864Z",
    "updatedAt": "2025-11-18T19:11:17.530864Z",
    "season": "July and August",
    "permits": "Check out Rosegarden and Meatgrinder on the drive to the put-in.",
    "flowUnit": "cms",
    "estimatedTime": "3-4 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "link-river",
    "riverId": "link-river",
    "name": "Link River",
    "difficultyClass": "Class III below the slides",
    "description": "Overview: The shortest river on Vancouver Island\n\nFlows: The Link River (upper Marble River on some maps) flows out of the large Victoria Lake, and is likely runnable consistently from October through May with the exception of very dry spells. Level is judged visually at the Southeast Main FSR bridge or at the campsite. If it looks like enough water to kayak, the canyon below the slides will be good to go. MARBLE RIVER AT OUTLET OF VICTORIA LAKE (08HE002). Limited historical gauge data from 1925-1931; 1932; 1933-1941; 1946-1953. Anything over 10cms should be boatable?\n\nShuttle: To get to the take out, take the north island highway past Port McNeill, turn west on Highway 30 (The Frigon Road) towards Port Alice. After passing Marble River Provincial Park, but before reaching Port Alice, turn left onto the Southeast Main and follow this ~6km to the Link River Campground. The lower put in is reached by taking the West Main (river left) to a bridge over the tiny Jeune Creek. Either drag boats 200m down this creek to the Link River, or bushwhack 100m directly to the confluence. If you must run the slides, the upper put in is reached by taking Victoria Lake Main (river right), and turning right onto a small branch road that leads to the lake outlet.\n\nOn the Water: The best way to explore the river is to bushwhack directly to the confluence of Jeune Creek and the Link River from river left. This puts you at the base of the slides, and at the start of the 1km section of class III down to the campsite on Alice Lake. At the lower put in, you can explore around to scout the big slide. If you decide to run it, just use the upper put in on Victoria Lake for your second lap.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/link-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:53.773791Z",
    "updatedAt": "2025-11-18T19:10:53.773791Z",
    "putIn": "is reached by taking the West Main (river left) to a bridge over the tiny Jeune Creek",
    "season": "October through May except for dry spells.",
    "permits": "Boat scoutable below the slides",
    "maxRecommendedFlow": 10.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours to explore the whole run. 15 minute laps on the lower half.",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "seymour-river-upper-run",
    "riverId": "seymour-river-upper-run",
    "name": "Seymour River – Upper Run",
    "difficultyClass": "Class III-",
    "description": "Overview: Pool-drop, some flat sections, gravel bed, low volume",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/seymour-river-upper-run",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:48.113572Z",
    "updatedAt": "2025-11-18T19:11:48.113572Z",
    "season": "Spring run-off and rain",
    "permits": "Scouting is easy, no portages required",
    "hazards": [
      "Portage required"
    ],
    "flowUnit": "cms",
    "estimatedTime": "3 hours",
    "difficultyMin": 3,
    "difficultyMax": 3
  },
  {
    "id": "mamquam-river-upper",
    "riverId": "mamquam-river",
    "name": "Upper",
    "difficultyClass": "Class III-IV",
    "description": "Overview: A fun and scenic class III+ stretch on the Upper Mamquam. The last two kilometres known as the Middle Mamquam is class IV, but please see the dam warning.\n\nFlows: The Mamquam gauge is newly online so we have yet to establish a solid correlation. 45-55cms translates to a nice low or medium-low level (though note that this still has a big volume feel for the last two kilometres). The gauge is quite far downstream (near town), so the correlation may not be consistent.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/mamquam-river-upper",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:04.711478Z",
    "updatedAt": "2025-11-18T19:11:04.711478Z",
    "season": "Early summer or after rainfall. The last 2km can be run year-round.",
    "permits": "More or less roadside",
    "minRecommendedFlow": 45.0,
    "maxRecommendedFlow": 55.0,
    "flowUnit": "cms",
    "estimatedTime": "2-3 hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "quesnel-river",
    "riverId": "quesnel-river",
    "name": "Quesnel River",
    "difficultyClass": "Class III+ to IV- (IV at High water)",
    "description": "Overview: Big Volume, with play waves at the top. Home of the Unlikely Fest.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/quesnel-river",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:11:35.119380Z",
    "updatedAt": "2025-11-18T19:11:35.119380Z",
    "season": "Summer / Late Summer",
    "permits": "Crux can be scouted easily",
    "flowUnit": "cms",
    "estimatedTime": "1-2hours",
    "difficultyMin": 3,
    "difficultyMax": 4
  },
  {
    "id": "fraser-river-alexandra-bridge-to-yale",
    "riverId": "fraser-river-alexandra-bridge-to-yale",
    "name": "Fraser River – Alexandra Bridge to Yale",
    "difficultyClass": "Class II-III, one IV-",
    "description": "Overview: Huge volume, pool drop, big crashing waves and swirly eddies, lots of floating. The road is high above the river and accessible only in a few spots.",
    "source": "bcwhitewater.org",
    "sourceUrl": "https://www.bcwhitewater.org/reaches/fraser-river-alexandra-bridge-to-yale",
    "createdBy": "bcwhitewater-import",
    "createdAt": "2025-11-18T19:10:00.792254Z",
    "updatedAt": "2025-11-18T19:10:00.792254Z",
    "season": "When everything else is too low. Winter and before the snow melt in spring (January to March) and occasionally in fall after a long drought.",
    "permits": "Scout Saddle Rock rapid. It takes some exploring to see it from the road. Portage is possible over big boulders (but not very pleasant).",
    "hazards": [
      "Portage required"
    ],
    "minRecommendedFlow": 700.0,
    "maxRecommendedFlow": 1300.0,
    "flowUnit": "cms",
    "estimatedTime": "Long (its 20km)",
    "coordinates": {
      "latitude": -1.0,
      "longitude": 300.0
    },
    "difficultyMin": 2,
    "difficultyMax": 4
  }
]