{
  "id": "foley-creek",
  "url": "https://www.bcwhitewater.org/reaches/foley-creek",
  "source": "bcwhitewater.org",
  "country": "Canada",
  "province": "British Columbia",
  "last_updated": "2025-11-18T19:09:59.225582Z",
  "title": "Foley Creek",
  "river_name": "Foley Creek",
  "contributor": "David Wortley",
  "whats_it_like": "An alternative start to the Chilliwack Canyon",
  "difficulty": {
    "text": "III(+) with potential IV moves with wood.",
    "min": 3,
    "max": 4
  },
  "scouting_portaging": "Can see most of run from the road.",
  "time": {
    "original": "30-45mins"
  },
  "when_to_go": "Fall-Spring\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"A wood-filled ditch barely wide enough for a creekboat sideways.\" That was the beta I had been given before but upon actually running this creek there was potential for much more from this little tributary of the Chilliwack.  This creek is basically an alternative put-on for the Chilliwack Canyon which gives you 3.5km extra river running.  It is mostly Class III with some spots that require some sharp maneuvers and below the Bench Road Bridge it is slightly harder and probably with high water it would be Class IV. Be aware that when this creek is in, the Chilliwack Canyon is probably going to be high enough to be continuous Class IV whitewater.  Luckily doing this run after a large storm most of the river was clear of wood, but you can inspect most of the run as you drive up.   There is only one larger rapid which isn't visible from the road but you can scout it easily.Don't expect wonders from this creek, you need quite high flows in the Chilliwack to even give you enough water to consider this 'in'.   I would have liked another 6inches or so water in the run to clean it up and make some of the bigger stuff nicer! The Chilliwack was running at 1.5m after about 30mm of rain overnight that also left a very visible snow-line, but it also had stopped raining for a few hours. Typically it'll be in when the Chilliwack has climbed quickly due to rain, but can also be in on snowmelt alone.  To get there drive to the Chiliwack Canyon take-out at Slesse Creek, that is the normal take-out of this run including the Class IV run.  Continue to the canyon put-on, cross over the Chilliwack, turn left down Bench Forest Service Road.  Drive until you go passed the main Chilliwack and see a smaller creek on your left.  Take a look as you drive up and stop at the bridge and have a look at the gauge rock.  If water is just going over this rock then it's on the good side of low, but has been paddled/rock-bashed lower. Make your own assessment, if you like the look of this section then you'll probably enjoy the rest of the run too.  If you don't like the look of it, turn around and go to the regular Chilliwack Canyon put-on instead.\n\n\n      The gauge rock, the middle of the big rocks."
}