{
  "id": "granite-creek-tulameen",
  "url": "https://www.bcwhitewater.org/reaches/granite-creek-tulameen",
  "source": "bcwhitewater.org",
  "country": "Canada",
  "province": "British Columbia",
  "last_updated": "2025-11-18T19:10:16.689704Z",
  "title": "Granite Creek (Tulameen)",
  "river_name": "Granite Creek (Tulameen)",
  "contributor": "Scott McBride",
  "whats_it_like": "A decent low volume canyon run, but not recommended due to very dangerous mining adits",
  "difficulty": {
    "text": "IV+ (P)",
    "min": 4,
    "max": 4
  },
  "scouting_portaging": "Lots of scrambling to scout canyons. Portaging at river level often not possible.",
  "time": {
    "hours_min": 8,
    "hours_max": 8,
    "original": "Up to 8 hours for a first run. Probably one hour to bomb it."
  },
  "when_to_go": "Late Spring - May-June",
  "gauge": "3.19cms↓ (Oct 21 05:20)\n!",
  "flows_description": "The Tulameen watershed is on the dry side of the Coast Mountains, and the snowmelt season usually only lasts a few weeks in May and June. Granite Creek does not have a gauge, but at the takeout bridge the creek should look like you can get down without bumping rocks too much, but it shouldn't look high. The canyons upstream narrows to 3m width in places. There should be a decent correlation with the Tulameen gauges: a medium-low flow on Granite Creek equated to 20cms on Tulameen below Vuich Creek and 60cms on Tulameen at Princeton.",
  "shuttle_description": "The takeout is at Granite Creek Recreation Site just outside of Coalmont, which can be reached by a paved roads branching off Highway 3 in Princeton. Total driving time from Vancouver is 4 hours. The Tulameen zone can also be accessed from the Coquihalla Highway via forest service roads. To get to the put in, drive up Granite/Blakeburn FSR on river left for ~6km to the ghost town of Blakeburn. Here, bear left onto Arrastra FSR which switchbacks down to Blakeburn Creek. The safest put in is at the confluence of Blakeburn Creek (too small to paddle) and Granite Creek, but you will have to find a way to bushwhack down to that point. Or, for the most whitewater, keep driving upstream to a a pullout on the left 300m past a bridge over Newton Creek, where a trail leads down to near the confluence of Newton Creek and Granite Creek. This put in is below the logjams and at the start of the whitewater, but above the a dangerous mining tunnel. A final option is to put in where the Arrastra FSR drops down to creek level, but by putting in here you will have to deal with a few sketchy logjams as well as the dangerous tunnel.",
  "on_the_water_description": "From this uppermost put in, where Granite Creek is roadside, the paddle starts as wood choked class III-IV down to Newton Creek. From Newton Creek down to the Tulameen, Granite Creek alternates between continuous class III+, tight class IV boulder drops, and four narrow canyons. Boat scouting is often possible, but you will frequently be catching one-boat eddies or grabbing willow branches to scramble up and scout around corners and down into canyons. The canyons come up quickly. Wood portages are likely, but the creek is not a wood-choked disaster. The first canyon is a committing narrows that may be difficult to portage, but contains only one easy ledge. The second canyon is extremely dangerous, as most of the river goes underground in an abandoned placer mining drain tunnel, and it is not easy to spot this feature or to stop above it. Putting on above this feature is not recommended. If you do, it is possible to get out well above the feature, and portage on river left up and over a ridge down into Blakeburn Creek, but this will probably take over an hour. Portaging at river level may be possible, but there is significant exposure to the drain. Below the adit, and a mostly dewatered section, the second canyon appears to consist of a boxed in series of ledge holes, although this was not paddled. At some point in the second canyon the water re-enters Granite Creek through the exit of the mine tunnel. This whole mess can be avoided by putting on at the confluence of Blakeburn Creek and Granite Creek. Below Blakeburn Creek, the third canyon is quite narrow and has a series of runnable ledge holes. If necessary, it can be portaged along a narrow ledge on river right about 20m above river level. The fourth canyon contains a boulder sluice into an excellent 4m waterfall into a huge pool. Portaging this one (on the right) is probably sketchier than just running it. From here the difficulty eases up to the takeout, and it's easiest just to take out at the rec site on the Tulameen River. An old cabin near the confluence of Newton and Granite Creeks."
}