{
  "id": "iskut-river-kinaskan-lake-down",
  "url": "https://www.bcwhitewater.org/reaches/iskut-river-kinaskan-lake-down",
  "source": "bcwhitewater.org",
  "country": "Canada",
  "province": "British Columbia",
  "last_updated": "2025-11-18T19:10:31.438792Z",
  "title": "Iskut River - Kinaskan Lake down",
  "river_name": "Iskut River",
  "section_name": "Kinaskan Lake down",
  "contributor": "Scott McBride",
  "whats_it_like": "An easy roadside float",
  "difficulty": {
    "text": "II",
    "min": 2,
    "max": 2
  },
  "scouting_portaging": "Scouting not necessary. 1km portage from takeout back to the highway.",
  "time": {
    "hours_min": 2,
    "hours_max": 4,
    "original": "2-4 hours"
  },
  "when_to_go": "Summer",
  "flows_description": "This section should be runnable all summer, it will be continuous during snowmelt in June. ISKUT RIVER AT OUTLET OF KINASKAN LAKE (08CG003). Gauge inactive.",
  "shuttle_description": "The run is located about 2 hours south of Dease Lake on Highway 37. The put in is on the lake at Kinaskan Lake Provincial Park campground. The takeout is 7km further south on Highway 37, at a trailhead for Natadesleen Lake. It's about a 1km hike out from Natadesleen Lake back to the highway.",
  "on_the_water_description": "Paddle 1km west from the campground to the Iskut River outlet from Kinsaskan Lake. The 7km section down to Natadesleen Lake has calm sections, swift sections, and a few boulders to avoid. BC Parks lists this as a canoeing section. On Natadelseen Lake, paddle 1km southwest and look for the Lower Cascade Falls Trail on river right at the outlet. Do not paddle into the Iskut River below Natadelseen Lake, as Cascade Falls is just downstream. Cascade Falls should be considered unrunnable, although there is a rumour of a well known kayaker having a go at the left channel. After hiking to Cascade Falls and back, paddle 1km east across Natadesleen Lake, and hike 1km back to the highway along a trail and some boardwalks. BC Parks"
}