{
  "id": "troutline-creek",
  "url": "https://www.bcwhitewater.org/reaches/troutline-creek",
  "source": "bcwhitewater.org",
  "country": "Canada",
  "province": "British Columbia",
  "last_updated": "2025-11-18T19:12:36.653254Z",
  "title": "Troutline Creek",
  "river_name": "Troutline Creek",
  "contributor": "Scott McBride",
  "whats_it_like": "A novelty subalpine float, with stouts downstream left to explore",
  "difficulty": {
    "text": "I-II; V+ Canyon Below",
    "min": 1,
    "max": 5
  },
  "scouting_portaging": "Not necessary on the upper; exploratory on the lower canyon",
  "time": {
    "hours_min": 1,
    "hours_max": 1,
    "original": "1 hour for the upper float; exploratory for the lower canyon"
  },
  "when_to_go": "Summer",
  "gauge": "13.2cms↓ (Oct 21 05:40)\n!",
  "flows_description": "Troutline Creek is probably best in early summer, as it is near the headwaters in an unglaciated area. June is probably best for the easy float through the upper valley. Sometime later in the summer, the lower canyons should drop into a reasonable flow, but they probably get too low at some point. The nearest gauge is in a different watershed, but may be helpful for estimating flows (COTTONWOOD RIVER ABOVE BASS CREEK (10AC005)). A flow of ~75cms on this gauge correlated to enough water for the upper float on Troutline Creek, although the lower canyons looked a bit high and were not paddled. Historical Max/Min/Mean Hydrometric Data Graph for COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) [BC]. From a different drainage, but may represent flow conditions in the region.",
  "shuttle_description": "This semi-roadside section is located about 2 hours north of Dease Lake along the road to the abandoned mining town of Cassiar. The take out for the lower canyons is located on the outskirts of Jade City. To get to the put in, drive 2km NE on Highway 37, turn left onto the Cassiar Road, and zero your tripmeter. After ~5.7km, the first bridge is over Quartzrock Creek, but keep going as this creek doesn't look good to go. At ~7.3km, a spur road on the left leads 300m to an intermediate access point on Troutline Creek, which can be used to split the run between the upper class II float and lower class V canyons. At ~12.8km from the highway, a giant pile of asbestos mine tailings will come into view, and a quick left turn towards the airstrip will have a couple put in options.",
  "on_the_water_description": "Putting on near the airstrip, Troutline Creek is a novelty ~5km class I-II float through subapline meadows that should take under an hour. The road is never too far away in this upper section. Make sure to scout a take out point if you are not planning to continue into the lower canyons. Drone flights of the lower canyons showed a few class V (?) drops of varying quality, although flows looked a bit on the high side at ~75cms on COTTONWOOD RIVER ABOVE BASS CREEK (10AC005) in early July 2022. If you have information or photos of running this section feel free to send them in. A successful descent of this lower canyon section of Troutline Creek would mostly be a coincidence of a crew happening to be in the area during the presumably narrow window of appropriate flows. The road is not close to the river for this lower canyon section. Looking upstream at the old Cassiar mill site and asbestos tailings. The road in is on the right, the old airstrip on the left. Looking downstream at the upper Troutline valley. Typical views in the upper Troutline valley. The upper class I-II float on Troutline Creek. Some of the better class V (?) drops that make the lower Troutline Creek canyons look worth paddling. A stouter drop that looks less good to go."
}