{
  "id": "white-river-nass-tributary",
  "url": "https://www.bcwhitewater.org/reaches/white-river-nass-tributary",
  "source": "bcwhitewater.org",
  "country": "Canada",
  "province": "British Columbia",
  "last_updated": "2025-11-18T19:12:56.093335Z",
  "title": "White River (Nass tributary)",
  "river_name": "White River (Nass tributary)",
  "contributor": "Scott McBride",
  "whats_it_like": "A high volume tributary to the Nass",
  "difficulty": {
    "text": "IV",
    "min": 4,
    "max": 4
  },
  "scouting_portaging": "The bigger rapids can be scouted",
  "time": {
    "hours_min": 2,
    "hours_max": 3,
    "original": "2-3 hours"
  },
  "when_to_go": "April to October",
  "gauge": "600.0cms↓ (Oct 21 06:10)\n!",
  "flows_description": "The White flows all summer, and likely correlates with the Nass gauge. It is not a small river, as it contributes a decent portion of the Nass directly from the massive Cambria Icefield. High water could get too boily. Information for this description is based on flows of 700cms in September (NASS RIVER ABOVE SHUMAL CREEK 08DB001).",
  "shuttle_description": "The run is located near Meziadin Lake on Highway 37 north of Terrace. There are two takeout options: a lower option at the normal Nass day section takeout at the Arbor FSR bridge, and an upper unmarked option along Highway 37 just north of Moore Creek. The put in should be reached by continuing north, crossing the Nass River on the Meziadin Bridge, and turning left onto Meziadin FSR. Cross the old airstrip and the Meziadin River, then and continue for 16km to the put in at a bridge over the White River. After finishing paddling, the Meziadin River fish ladders are nearby and are worth checking out.",
  "on_the_water_description": "The run starts right away with a boily, read and run, low gradient, class III-IV open canyon, which continues for several kilometers. Somewhere in this first section on a right turn is a pinch rapid that is a bit gross, at normal flows it can be portaged on slabs on river left. Then the river gradually opens up and mellows out to class II for several kilometers. About 1km before the Nass confluence, there is an easy pinch on a sharp left turn. From this pinch down to the Nass are a couple technical class IV rapids. Immediately after the confluence is a sizeable class IV rapid on the Nass. After this rapid look for a waterfall on river left of the Nass (Moore Creek). This is one takeout option, a steep 500m bushwhack out to the highway that is pretty thick but doable. Or, continue downstream on the Nass for more class III-IV rapids down to the normal takeout at the Arbor FSR bridge. In total, the paddle is about 15km on the White River and an additional optional 20km on the Nass River. Meziadin FSR bridge over the White River at the put in. Looking downstream from the put in bridge on the White River. A gross pinch rapid in the first canyon. Technical class IV just above the Nass confluence. Confluence of White (bottom) and Nass (left to right) Rivers."
}